[
  {
    "id": "https://www.reddit.com/r/OnlineEducation/comments/1qc543r/liberty_online_vs_snhu_transfer_student_w_sap/",
    "post_title": "Liberty Online vs SNHU — transfer student w/ SAP issues, mental health burnout, need honest advice",
    "post_url": "https://www.reddit.com/r/OnlineEducation/comments/1qc543r/liberty_online_vs_snhu_transfer_student_w_sap/",
    "post_date": "2026-01-13T22:11:34",
    "post_content": "Hi everyone, I’m looking for genuine, honest advice because I don’t really have anyone guiding me through this and I’m starting to second-guess myself. I’m 18 and recently attended American Military University (AMU). I struggled badly with burnout, anxiety, and stress, which seriously affected my academics. I lost financial aid there due to SAP issues and was dropped from courses when I couldn’t pay out of pocket. I completed about 9 credits total. I’ve learned a lot from that experience and I’m trying to reset slowly and responsibly, not rush into another bad situation. Right now, I’m deciding between Liberty University Online and SNHU (online). Here’s my situation and plan: • I want to take only 2 classes at a time • I am not taking out student loans • I’m prioritizing mental health and pacing myself • Liberty confirmed my SAP does NOT follow me, so I’d have a clean slate there • I understand all transcripts still matter long-term • I’m okay transferring again later if needed once I’m academically stable  My concerns: • Liberty’s reputation (I’ve seen very mixed opinions, some extremely negative) • SNHU seems to have a better general reputation, but I don’t know how strict they are with prior SAP issues • I don’t want to go into debt or end up with credits that don’t transfer • I want a school that’s flexible, asynchronous, and realistic for someone rebuilding academically  My goals: • Finish a bachelor’s degree (health-related field) • Possibly attend grad school later if I’m able (I want to go to PA school once I graduate) • Avoid unnecessary debt • Prove to myself I can succeed academically when paced correctly  I’m not here to argue or defend any school — I genuinely want to make the smartest, safest decision given my history. If you were in my position: • Would you choose Liberty Online or SNHU? • Is starting at Liberty to rebuild GPA and then transferring a bad idea? Cause that’s what I’m thinking of doing right now • Are the reputation concerns something that actually matters in real life, or more online discourse?  I really appreciate anyone who takes the time to respond thoughtfully. I’m trying to do better and not repeat past mistakes.    submitted by    /u/sillycars_27   [link]   [comments]",
    "source_community": "OnlineEducation",
    "post_author": "/u/sillycars_27",
    "score": 0,
    "comment_count": 0,
    "signal_score": 3
  },
  {
    "id": "https://www.reddit.com/r/Teachers/comments/1qdwa81/kinder_horrible_behaviors/",
    "post_title": "Kinder HORRIBLE behaviors",
    "post_url": "https://www.reddit.com/r/Teachers/comments/1qdwa81/kinder_horrible_behaviors/",
    "post_date": "2026-01-15T21:23:31",
    "post_content": "First year teacher, kinder, title 1. I’m struggling so bad.  Maybe 3 students in my class repeatedly cry, throw chairs, pick up tables, scream, kick and hit things in the room. I feel so so so bad calling admin in so much but I had tried everything, and their behavior doesn’t let the rest of the class learn and is unsafe! I’ve tried parents, positive reinforcement, rewards. Nothing is working. Is it the area? Is it the grade? Is it the school? Is it the county? Please please I’m in so much need for advice. I ask the students what their parents say and they usually say they said nothing. Maybe it’s the grade level? I can’t even teach. Like, it’s bizarre. I feel like I should be a paid counselor for these students on top of my teacher salary because I work so much before, during, and afterschool. Then I have to constantly deal with behaviors. It honestly feels impossible and I don’t like who I am at the end of everyday because the students who are always listening and behaving cat even get my attention due to the bad behavior ones. Do I ignore the behaviors???? Do I dismiss??? Or is this expected and normal in kindergarten to do this all day. There’s also no plan for the behaviors, they come in the next hour or so from the office with a “sorry” piece of paper then repeat the behavior 2 minutes later. I’m drowning and don’t know if this stress is worth the pay. Documentation, lesson planning in my free time (nonexistent during contract hours) meetings, data expectations, observations, parents, im drowning. I go home and do more work I couldn’t get done during the day and feel like I yelled at kids all day and hate myself… and slowly this job    submitted by    /u/RadiantPixieDust   [link]   [comments]",
    "source_community": "Teachers",
    "post_author": "/u/RadiantPixieDust",
    "score": 0,
    "comment_count": 0,
    "signal_score": 2
  },
  {
    "id": "https://www.reddit.com/r/Teachers/comments/1qdvvvc/child_pees_herself_when_she_sees_mom_and_mom/",
    "post_title": "Child pees herself when she sees mom and mom keeps accusing us of not changing her..",
    "post_url": "https://www.reddit.com/r/Teachers/comments/1qdvvvc/child_pees_herself_when_she_sees_mom_and_mom/",
    "post_date": "2026-01-15T21:09:08",
    "post_content": "I’m a preschool teacher and have this sweet little 4 year old in my class. For the last year she has primarily been dropped off and picked up by dad. Recently their custody agreement changed and mom has been picking up a couple times a week. For the last few weeks she has been going to our director and accusing my coteacher and I of not changing her child’s pull up as she’s been wet every time she’s picked her up. We were perplexed as we know we do change her regularly. However, yesterday…we’re all at the bathroom and I changed, we’re gonna call her Sally, and not even a minute later her mom shows up to get her. Sally looks a bit sad and mom checks her pull up and sure enough…it’s wet. That’s when we put together exactly what was going on. We told our director who believes us but doesn’t want to offend the mom. What do we do now??? We don’t want to keep being harassed about something that’s not actually happening but also won’t go over our bosses head.. ETA: I’m so sorry for everyone who was concerned we weren’t reporting this! I see now how that read and want to clarify our director has reported this to CPS! I’m so sorry I figured everyone would know we did that as we are all mandatory reporters. I have been in this field for years, just because I do not personally believe there’s physical abuse at home, does not mean we wouldn’t report what is an obvious sign of distress. I’m sorry to anyone who was concerned about that! My post was more about seeking advice on how to handle mom going forward as we can’t just tell her we called CPS. I just don’t want to be berated anymore for something that’s not happening. Also, we do have an app where all her bathroom breaks are documented, mom just doesn’t believe they’re actually happening.    submitted by    /u/Automatic_Rip7076   [link]   [comments]",
    "source_community": "Teachers",
    "post_author": "/u/Automatic_Rip7076",
    "score": 0,
    "comment_count": 0,
    "signal_score": 2
  },
  {
    "id": "https://www.reddit.com/r/Teachers/comments/1qdsfex/favorite_pds_that_were_not_just_prep_time/",
    "post_title": "Favorite PDs that were NOT just prep time?",
    "post_url": "https://www.reddit.com/r/Teachers/comments/1qdsfex/favorite_pds_that_were_not_just_prep_time/",
    "post_date": "2026-01-15T19:00:48",
    "post_content": "I’m in a teacher lead role at my school where sometimes I am asked to lead activities during professional development. I know we’d all rather just have prep time, but what PD activities have you liked over the years?     submitted by    /u/dixpourcentmerci   [link]   [comments]",
    "source_community": "Teachers",
    "post_author": "/u/dixpourcentmerci",
    "score": 0,
    "comment_count": 0,
    "signal_score": 2
  },
  {
    "id": "https://www.reddit.com/r/teaching/comments/1qcvc74/middle_school_model_that_doesnt_treat_electives/",
    "post_title": "Middle School model that doesn't treat electives as second class citizens?",
    "post_url": "https://www.reddit.com/r/teaching/comments/1qcvc74/middle_school_model_that_doesnt_treat_electives/",
    "post_date": "2026-01-14T18:35:27",
    "post_content": "I'm trying to understand if this is typical or just my school. I teach a middle school elective. We have an eight period day. The core teachers (math, ELA, social studies, and science) teach five periods, have a team period, prep and lunch. Elective teachers teach six (not five, edited) periods, have a prep and lunch. We are not compensated for the extra class, even though elementary and high school teachers are. We've brought it up with the union, but since it only affects a small percentage of the whole union, they don't seem to care. The core teachers get information during their team periods. Administration will come in and discuss issues. Guidance will touch base during team periods. Elective teachers are out of the loop. We don't find out about assemblies until a day before, if that. It makes planning hard. The core teachers use their team meeting for grading and planning on most days. When they do discuss students, they don't communicate with the elective teachers. Recently they had a meeting with a parent about their child failing. The Spanish teacher and music teacher didn't know about the meeting and weren't told about it until two weeks later. Are there any middle school teachers that have a middle school model that works?    submitted by    /u/Material-Rise9610   [link]   [comments]",
    "source_community": "teaching",
    "post_author": "/u/Material-Rise9610",
    "score": 0,
    "comment_count": 0,
    "signal_score": 2
  },
  {
    "id": "https://www.reddit.com/r/teaching/comments/1qcht6t/how_to_not_just_survive_but_thrive_as_a_teacher/",
    "post_title": "How to not just survive but thrive as a teacher",
    "post_url": "https://www.reddit.com/r/teaching/comments/1qcht6t/how_to_not_just_survive_but_thrive_as_a_teacher/",
    "post_date": "2026-01-14T08:15:06",
    "post_content": "After 22 years of teaching, I reached out to this community to ask for tips and advice on how to stay positive in the profession and, ultimately, how to reach retirement still enjoying the job. The grind had started to get to me, and I was looking for some perspective. The responses I received were genuinely amazing, thoughtful, and reassuring, so I wanted to share them here in the hope that they might help others too. I would also really love to hear your thoughts and experiences in the comments. .  Work in a school where you have friends This was mentioned repeatedly, and it makes absolute sense. If you are going to school every day, you are essentially going to spend your time with people, so make sure those people are ones you genuinely like. When your colleagues are your friends, work becomes somewhere you want to go. Investing emotional energy into building positive relationships with staff can completely change how each day feels. Never stop learning your subject Staying curious and continually developing your subject knowledge came up a lot. Taking courses, reading, or exploring new ideas within your subject does not just make you better at your job, it re-energises you. That new knowledge feeds into conversations with colleagues and, more importantly, into your teaching. When you are excited about what you teach, pupils feel it. It keeps lessons fresh and reminds you why you loved your subject in the first place. Stay away from the bitching This one was huge. So many staffrooms, and sometimes SLTs, can become incredibly toxic. The advice was to have a zero tolerance for bitching, moaning, and constant negativity. That kind of environment just eats away at your energy day after day. Surround yourself with positive, solution-focused people and quietly step away from conversations that drag you down. Protecting your energy is essential for longevity. Remember you are dealing with kids This felt like the most important reminder of all. Even the best kids get it wrong. Poor behaviour is not a personal attack, and taking it as one will exhaust you. Pupils come from hugely varied backgrounds and bring all of that into school with them. The advice was to stay emotionally detached from poor behaviour, respond professionally, but do not internalise it. Behaviour will always be challenging, even in the best schools, and that is just part of working with children.  There were also a few smaller nuggets that made me smile, like “be good enough that they leave you alone”, but overall, these four stood out.    submitted by    /u/P45teachingpodcast   [link]   [comments]",
    "source_community": "teaching",
    "post_author": "/u/P45teachingpodcast",
    "score": 0,
    "comment_count": 0,
    "signal_score": 2
  },
  {
    "id": "https://www.reddit.com/r/Teachers/comments/1qe7q6t/tired_of_can_i_go_to_the_bathroom/",
    "post_title": "Tired of \"Can I go to the bathroom.\"",
    "post_url": "https://www.reddit.com/r/Teachers/comments/1qe7q6t/tired_of_can_i_go_to_the_bathroom/",
    "post_date": "2026-01-16T05:44:55",
    "post_content": "Most of my classes are great, but I have like 1 or 2 classes where the same 5-6 kids are asking to go to the bathroom, and it literally is chipping away at my willpower.  I used to be very easy going on the bathroom till admin dinged me on an observation for letting kids go to the bathroom too easily. Now I try to really only let one or two go at a time.  But every day it's the same kids, and I know most of them just want to walk around for a bit. Which I'm cool with most of the time, but when you're shouting out \"Can I go to the bathroom now?\" or \"Am I next?\" when someone goes back, even as I'm trying to explain something, it makes me wanna just tell everyone no.  I have empathy for kids who just need a moment to walk around. I have empathy for the kids who need a break because they struggle with reading and writing, and want a moment to breathe. But when kid after kid after kid after kid is asking and I can't even hear myself think. And it's in my classes where most of them could realistically go before class because they have a 15-minute and 30-minute break before hand.  Like today, as I was talking to the whole class, a kid just shouted out, \"Can I go refill my water bottle?\"  I feel like with bathroom policies, you're damned if you do and damned if you don't. Like, if you let kids out constantly and they cause trouble, the admin will come at you. If you don't let kids out, kids complain, and the admin comes to you.  Or you let one kid out, he takes close to an hour because he just wanted to walk around and doesn't care about the other kids, and suddenly they're complaining because he's taking too long.     submitted by    /u/Consistent-Row-9551   [link]   [comments]",
    "source_community": "Teachers",
    "post_author": "/u/Consistent-Row-9551",
    "score": 0,
    "comment_count": 0,
    "signal_score": 1
  },
  {
    "id": "https://www.reddit.com/r/Teachers/comments/1qe76j2/blamed_for_students_inappropriate_behaviour/",
    "post_title": "Blamed for student's inappropriate behaviour",
    "post_url": "https://www.reddit.com/r/Teachers/comments/1qe76j2/blamed_for_students_inappropriate_behaviour/",
    "post_date": "2026-01-16T05:15:51",
    "post_content": "I have a 6 year old student with autism. He's a brilliant kid, but he has a major problem with touching himself in class, trying to reach up my skirt, and reaching for my chest area.  I have reported this multiple times to my manager. And I immediately remove myself when he reaches for me inappropriately. All my manager does is call him into the office to calmly talk to him. (This is a gentle parenting/parent ass kisser school).  This week I caught him m******ing to completion in my class. I was absolutely horrified. Never in my 10 years of teaching have seen this from a 6 year old.  I immediately went to my manager and said we NEED to take action. I met with his mother once, who casually brushed his self-touching off as normal. (Okay, yes it's normal as a self soothing mechanism with some children who have special needs - but NOT to this degree!!!)  My concern is abuse, exposer to something, or other harm.  After doing everything from redirection, applying all I've learned from experience and training, and constant reporting, I got blamed for this: My manager called me in to say that my dresses are too short (4 fingers above the knee). And that this could be one of the causes.  I was stunned and couldn't find words. How am I even in this position? Am I at fault? I genuinely want to know.  *Based in the US, CA.     submitted by    /u/Warm_Kick_4374   [link]   [comments]",
    "source_community": "Teachers",
    "post_author": "/u/Warm_Kick_4374",
    "score": 0,
    "comment_count": 0,
    "signal_score": 1
  },
  {
    "id": "https://www.reddit.com/r/HomeschoolRecovery/comments/1qe561c/homeschool_was_a_nightmare/",
    "post_title": "Homeschool was a nightmare.",
    "post_url": "https://www.reddit.com/r/HomeschoolRecovery/comments/1qe561c/homeschool_was_a_nightmare/",
    "post_date": "2026-01-16T03:36:09",
    "post_content": "Trigger warning (emotional abuse) I don’t really have a safe place to say this, but I need to get it out. I was homeschooled my entire life until high school, mostly by my father. Looking back, I believe he seriously damaged my self-esteem and nervous system. Even now, stress causes intense physical reactions flushing, sweating, my mind going blank, and breaking down crying. As a child, I lived in constant fear of making mistakes. He would raise his voice, bulge his eyes, throw things, and violently break objects if I got something wrong. Asking for help never felt safe, even though I was told to “ask questions.” He said many cruel things. Even harmless things I enjoyed, like watching princess movies, were mocked. He told me things like, “This BS makes you an idiot.” Sometimes my mom would get angry at him and he’d apologize later, promising it wouldn’t happen again but it always did. When she wasn’t around, he told me not to tell her. I became so afraid of mistakes that I started cheating just to avoid his anger. When he found out, he said I had made him a liar for telling people I was smart. I felt completely alone. I believe this led to depression. I wanted someone to help me out of that life SO bad. I know I’m not the only one who has experienced this, please share your experience with me.    submitted by    /u/Unique-Thing-9463   [link]   [comments]",
    "source_community": "HomeschoolRecovery",
    "post_author": "/u/Unique-Thing-9463",
    "score": 0,
    "comment_count": 0,
    "signal_score": 1
  },
  {
    "id": "https://www.reddit.com/r/Teachers/comments/1qe52dy/gradeflation_minimum_50s_discourse/",
    "post_title": "Grade-Flation (Minimum 50's Discourse)",
    "post_url": "https://www.reddit.com/r/Teachers/comments/1qe52dy/gradeflation_minimum_50s_discourse/",
    "post_date": "2026-01-16T03:31:19",
    "post_content": "I know this has been talked about in this sub but this week I experienced two situations of colleagues remarking on the minimum failing score 50's thing our school implemented this year, by that I mean the principal. If one enters a 0 in the grade book (we use Jupiter), their grade defaults to a 50. In fact, anything under a 50 is a 50, whether it is a blank paper or whether the student tried but did not succeed. Monday we had small group meetings and this dominated the conversation for the first 30 minutes. One teacher remarked \"this is just grade inflation. It is unethical.\" She showed the grades of a student who got a 74 in marking period one and then just did not show up for the 2nd and 3rd marking periods, and whom would get a 67 overall grade. \"I just can not in good conscience give this student a passing grade, I won't do it\" was her followup remark. Just today, this was also the discussion in our grade team meetings. One colleague who has been teaching for nearly 50 years stated he was more concerned about the high flyers, the ones who come in, want to be challenged and get high grades, considering that they may not be as willing to do the work. Some students have already figured the system out and are exploiting it so to speak. I don't know if this will lead to real change. Our principal is generally supportive, but on this one issue, which I told her last year was a really bad idea for obvious reasons, distinctly started the year with \"We'll have conversations about this.\" There were no conversations, a decision was made and that was it. However, given the groundswell of opposition, being that no teacher in our school supports this, perhaps conversations will be had, especially as we round out the Fall semester.    submitted by    /u/bkrugby78   [link]   [comments]",
    "source_community": "Teachers",
    "post_author": "/u/bkrugby78",
    "score": 0,
    "comment_count": 0,
    "signal_score": 1
  },
  {
    "id": "https://www.reddit.com/r/Teachers/comments/1qe25ka/my_fifth_graders_class_isnt_reading_novels/",
    "post_title": "My fifth grader’s class isn’t reading novels",
    "post_url": "https://www.reddit.com/r/Teachers/comments/1qe25ka/my_fifth_graders_class_isnt_reading_novels/",
    "post_date": "2026-01-16T01:20:53",
    "post_content": "Is this normal? My kid hasn’t brought home any homework, at all, ever. Which is odd, but I assumed that they were just doing all the work at school now. But when I was talking with my kid about pets I mentioned Where The Red Fern Grows and we got to talking about books in school and I found out that not only are they not assigned novels, they aren’t assigned chapter books. They are read to. By the teacher. They are read picture books, on a carpet, by the teacher. No novels, no reading on their own and discussing the book as a class. Is this standard now? Is it just my kid’s school? ETA: I want to clarify that I don’t blame the teachers for this. I live in a place (Twin cities, Minnesota) where there are other priorities, such as most of the teachers needing to use food shelves and setting up a virtual option for students since it’s dangerous for a large number of parents and guardians getting to and from school right now. I’m not mad about this. I’m frustrated about it, sure, but it isn’t that serious. I can supplement at home just fine.    submitted by    /u/Sam-HobbitOfTheShire   [link]   [comments]",
    "source_community": "Teachers",
    "post_author": "/u/Sam-HobbitOfTheShire",
    "score": 0,
    "comment_count": 0,
    "signal_score": 1
  },
  {
    "id": "https://www.reddit.com/r/teaching/comments/1qe0s8w/gender_neutral_pronouns_in_atas_exam/",
    "post_title": "Gender neutral pronouns in ATAS exam",
    "post_url": "https://www.reddit.com/r/teaching/comments/1qe0s8w/gender_neutral_pronouns_in_atas_exam/",
    "post_date": "2026-01-16T00:21:01",
    "post_content": "Im in New York State about to take my Assessment of Teaching Assistant Skills (ATAS) exam. When I was younger, I remember using \"they\" and \"them\" as singular nouns was considered improper grammar by my teachers. I am doing some online practice tests and answers that use they/them as singular are being marked wrong. Is this still the case for the modern ATAS exam or were the practice tests I used out of date? Generally post-2016, I haven't been marked wrong for using singular they/them by any teachers or professors.     submitted by    /u/pooperskooper_9000   [link]   [comments]",
    "source_community": "teaching",
    "post_author": "/u/pooperskooper_9000",
    "score": 0,
    "comment_count": 0,
    "signal_score": 1
  },
  {
    "id": "https://www.reddit.com/r/Teachers/comments/1qe0hqi/are_teachers_required_to_like_their_students/",
    "post_title": "Are teachers required to like their students?",
    "post_url": "https://www.reddit.com/r/Teachers/comments/1qe0hqi/are_teachers_required_to_like_their_students/",
    "post_date": "2026-01-16T00:08:48",
    "post_content": "Tomorrow, I have a meeting with the parents of a student who believe that I dislike their child. The student is a fifth grader with a 504 plan for ADHD and demonstrates many of the behaviors commonly associated with it. Throughout the day, teachers frequently need to redirect him. Recently, he has been targeting some of the more vulnerable students in our grade, making unkind and sometimes mean-spirited comments. In particular, he has made inappropriate, sexually explicit remarks to several girls in our grade as well as to fourth-grade students. Also, this is his third school in three years. Am I out of line to not \"like\" this kid?    submitted by    /u/Serious-Process-979   [link]   [comments]",
    "source_community": "Teachers",
    "post_author": "/u/Serious-Process-979",
    "score": 0,
    "comment_count": 0,
    "signal_score": 1
  },
  {
    "id": "https://www.reddit.com/r/teaching/comments/1qe0g2p/it_has_been_a_week_i_dont_know_how_much_more_i/",
    "post_title": "It has been a WEEK. I don’t know how much more I can take.",
    "post_url": "https://www.reddit.com/r/teaching/comments/1qe0g2p/it_has_been_a_week_i_dont_know_how_much_more_i/",
    "post_date": "2026-01-16T00:06:59",
    "post_content": "Been dealing with a disrespectful parent all school year. She was back on her bs this week attacking me, putting me down, not agreeing with our curriculum and how it’s taught.  Had an emotional support student have outbursts every single day, causing disruption to my lessons.  Was told a parent called the principal and shared that their student was shoved by said student above and upset that I didn’t let them know… I had no idea this happened. Wasn’t under my watch.  Had 2 students make racist comments about others. Called home. One laughed and told me their child said nothing wrong.  Veteran teachers… how do you deal with this ongoing BS? I want to teach. I’m so sick of crappy parents and insane behaviors.     submitted by    /u/summalovinnn   [link]   [comments]",
    "source_community": "teaching",
    "post_author": "/u/summalovinnn",
    "score": 0,
    "comment_count": 0,
    "signal_score": 1
  },
  {
    "id": "https://www.reddit.com/r/Teachers/comments/1qe045d/whole_class_punishment_ideas/",
    "post_title": "Whole Class Punishment Ideas",
    "post_url": "https://www.reddit.com/r/Teachers/comments/1qe045d/whole_class_punishment_ideas/",
    "post_date": "2026-01-15T23:53:33",
    "post_content": "Okay buckle up cause this is a lot. Since the start of the school year, my whole class has been targeting and bullying this one child. I’m talking more than just name calling. Now some background on this child. He was fully diagnosed with autism when he was younger, then one day parents said he no longer has autism and fully declines any and all services…take that as you will. Naturally, this child severely lacks any kind of social awareness. Anyway, my class has constantly targeted him and will do anything to get him in trouble and make themselves look like the victim. They’ve constantly push him around, purposely try to trip him, chase him at recess, lie to adults about his behaviors, and start full on fights with him. There’s been so many instances where admin has come up to my room to have whole class discussions on their behaviors. Well today they took it even further. Long story short, kids violently attacked him while the others circled around and cheered. I now have multiple kids that are suspended and this child is moving to a new class.  Here’s where I need help…I’m worried my class will see this as a win and a reward because they are getting what they want. Him moved to a different class. I need them to know how extremely serious this is. I’m sure admin will come in and talk but that’s clearly meant nothing to them every other time. My class has already been on “probation” because of other behavior issues they’ve had this year. So they’ve lost all tech use, fun games, and the ability to talk while they work (I wish I was exaggerating when I say they literally cannot say anything nice when they speak). What is something I can do as a whole class punishment that would MAYBE help them realize how serious this is? Like I’m honestly thinking of asking admin to invite all their parents to come to my room and have a full on discussion about what’s been going on, but I don’t know how well that would go. I’m open to anything!!! P.S. the 4 kids who are never involved wouldn’t be a part of this punishment, though they will be there for my talk about speaking up for others.  EDIT: These kids are in 4th grade.     submitted by    /u/Clean_Bug   [link]   [comments]",
    "source_community": "Teachers",
    "post_author": "/u/Clean_Bug",
    "score": 0,
    "comment_count": 0,
    "signal_score": 1
  },
  {
    "id": "https://www.reddit.com/r/HomeschoolRecovery/comments/1qdzncy/is_the_current_teacher_crash_out_making_anyone/",
    "post_title": "Is the current teacher crash out making anyone else struggle with their experience and how they grew up?",
    "post_url": "https://www.reddit.com/r/HomeschoolRecovery/comments/1qdzncy/is_the_current_teacher_crash_out_making_anyone/",
    "post_date": "2026-01-15T23:34:48",
    "post_content": "Cw: Mentions of child abuse and educational neglect.  So, I've been getting recommended videos about public school crisis and why teachers are flat out giving up and quitting in the middle of the year (many didn't come back from winter break I guess?). I have spent pretty much my entire adult life condemning homeschooling as an unregulated void that hides abused children, and I still feel that way. But listening to these videos is genuinely heartbreaking. I don't have any kids, my dysfunctional family is a big reason why, but I had a thought during one of these videos that I'd rather homeschool my hypothetical kids than have them rot like this, but the thought made me feel lowkey disgusted and ashamed of myself because I'd rather homeschooling be illegal than have even one child grow up and have to overcome the level of educational neglect that I did. But the experience that some of these kids are having sounds almost worse in some ways than the educational neglect I had and I just can't even understand how that's possible. I had some formal education before I was homeschooled, and I still remember being challenged and what real school was like. I can't even imagine how severe the consequence would have been if my parents were told I was doing that bad. Now, I can't even blame some parents for looking at this situation and not wanting their kids to be apart of it. The whole thought spiral just made me feel like a massive hypocrite and I don't even know what to think about any of it now. I just feel an overwhelming sadness for the upcoming generation of kids. One of the videos I watched had a horrible but likely true comment, that the next class divide is going to be who can read and think critically, and who can't. And that's just heartbreaking. I feel like no matter what, there's a whole generation of kids who are going to have to go through everything I went through as I struggled to find autonomy in adulthood when they shouldn't have to, and the salvation is, what? Private school or the unregulated hell scape that is homeschooling? What a depressing thought.    submitted by    /u/LinverseUniverse   [link]   [comments]",
    "source_community": "HomeschoolRecovery",
    "post_author": "/u/LinverseUniverse",
    "score": 0,
    "comment_count": 0,
    "signal_score": 1
  },
  {
    "id": "https://www.reddit.com/r/Teachers/comments/1qdyxf7/high_school_algebra_is_actually_just_8th_grade/",
    "post_title": "High School Algebra is actually just 8th grade skills.",
    "post_url": "https://www.reddit.com/r/Teachers/comments/1qdyxf7/high_school_algebra_is_actually_just_8th_grade/",
    "post_date": "2026-01-15T23:05:28",
    "post_content": "I want to hear thoughts and opinions from all the math educators out there about an issue that my and my colleagues have had for a while. The issue is that most of what we teach for our freshman Algebra is just 8th grade skills according to our state standards yet none of our freshman in Algebra 1 have any of these skills or have even remotely retained them from 8th grade. For reference: I teach in WA state and I noticed that a skill for solving systems of equations is an 8th grade skill. I always thought it was a 9th grade skill, and I remembering doing it when I took Algebra 1 as an 8th grader but that was because I was on an accelerated track. As a teacher for the past 5 years I have always taught it as a 9th grade skill, but this has been from the ground up, no review or previous knowledge by any students. In fact, I have to teach solving one-step equations from the ground up and still at least 1/5 of my students at this point through the year fail to solve at least a couple variants of one-step equations. (Most are pretty good but it has taken many weeks to get there.) It is just wild to me to have slowly learned over time that most of the content I am teaching for 9th graders should have been taught to them in 8th grade. There are some pieces here or there that my 9th graders do recall from 8th grade but their ability to retain it is crap, even for my accelerated 9th graders that passed Algebra 1 in 8th grade and are in Geometry in 9th grade, their Algebra 1 skills are sometimes as just as bad as the non-accelerated learners. So my question to all of you is have you experienced the same thing? What have you done about it? Is this the fault of elementary and middle schools teachers not preparing students enough for high school? Is it a lack of skills by the students themselves?    submitted by    /u/Ichthyslovesyou   [link]   [comments]",
    "source_community": "Teachers",
    "post_author": "/u/Ichthyslovesyou",
    "score": 0,
    "comment_count": 0,
    "signal_score": 1
  },
  {
    "id": "https://www.reddit.com/r/Teachers/comments/1qdyayf/i_was_fired_but_in_the_most_unusual_way/",
    "post_title": "I was fired but in the most unusual way.",
    "post_url": "https://www.reddit.com/r/Teachers/comments/1qdyayf/i_was_fired_but_in_the_most_unusual_way/",
    "post_date": "2026-01-15T22:41:08",
    "post_content": "So I was in class teaching, and in walks in someone from the front office. With her is a lady I haven't seen before. The lady from the office says \"she will be shadowing you for a few days and then she will be teaching.\" \"Oh, which class \" say \"this one the lady says\" and walks off, doesn't tell me anything else. They gave me no prior notice, so I was shocked at this. Technically I was contracted to the school through an agency so I called my agency and they said they had only just heard about it. But for days couldn't get any details or what procedures I was supposed to do to turn in the property I had of the school (laptop, keys, etc.). Even the principal of the school didn't know because she sent me an email the next day where she talked as if I was going to be there, so it had come form the higher ups in the district. Has anyone experienced anything like this? I live in an at will employment state, so technically I can be fired for just about anything but my agency contract says they would have to receive prior notice.     submitted by    /u/Teacherman13   [link]   [comments]",
    "source_community": "Teachers",
    "post_author": "/u/Teacherman13",
    "score": 0,
    "comment_count": 0,
    "signal_score": 1
  },
  {
    "id": "https://www.reddit.com/r/teaching/comments/1qdwzpx/teaching_special_education_students_in_a_general/",
    "post_title": "Teaching special education students in a general education classroom.",
    "post_url": "https://www.reddit.com/r/teaching/comments/1qdwzpx/teaching_special_education_students_in_a_general/",
    "post_date": "2026-01-15T21:50:16",
    "post_content": "Give me your best strategies for modification and accommodations. Give me your best resources please. I’m struggling. (Also tell me it’s okay to not do it perfectly the first year lol).     submitted by    /u/Funny_Yoghurt_9115   [link]   [comments]",
    "source_community": "teaching",
    "post_author": "/u/Funny_Yoghurt_9115",
    "score": 0,
    "comment_count": 0,
    "signal_score": 1
  },
  {
    "id": "https://www.reddit.com/r/Teachers/comments/1qdvxlk/struggling_students_family_went_on_15_month/",
    "post_title": "Struggling student's family went on 1.5 month vacation",
    "post_url": "https://www.reddit.com/r/Teachers/comments/1qdvxlk/struggling_students_family_went_on_15_month/",
    "post_date": "2026-01-15T21:10:51",
    "post_content": "I don't know what flair to use for this, but I'm a sub. One of my students, she's definitely been working harder since the beginning of the school year, but she clearly struggles with all her subjects. She is not passing the class I co-teach in, math, although she went from consistent 20s and 30s to 50s and 60s. Right before winter break, she missed a few days of class. You know what I get it. It's normal with the break coming up. Well she still isn't back, and wont be for another week. She will have missed 3 weeks of instruction, and was already not doing the best. I'm just so pissed off with her parents!!! How could they think this was remotely acceptable?? It wouldn't be okay even if she was a top performing student, but to basically say her education isn't important? The school will he talking to her family and she may be held back. It just makes me so mad cuz I've been working a lot with her and she's been working hard and bc of smn out of her control she may have to repeat the grade. Some parents are so awful.     submitted by    /u/breatulu   [link]   [comments]",
    "source_community": "Teachers",
    "post_author": "/u/breatulu",
    "score": 0,
    "comment_count": 0,
    "signal_score": 1
  },
  {
    "id": "https://www.reddit.com/r/Teachers/comments/1qdszxz/unreal_experiences_as_a_sped_teacher_and_im_not/",
    "post_title": "Unreal Experiences As a SPED Teacher - and I'm Not Supposed to Judge",
    "post_url": "https://www.reddit.com/r/Teachers/comments/1qdszxz/unreal_experiences_as_a_sped_teacher_and_im_not/",
    "post_date": "2026-01-15T19:21:05",
    "post_content": "Admin never really supported me in any of these situations. Their ineptitude caused many paraprofessionals to leave. * One student would tell other boys how hot their dads are. He was punched in the face one time and seemed to enjoy it. One month went by and I thought I stopped this behavior. Nope! He stopped talking about all the \"daddies\" picking up and dropping off students. However, in Art class he started sketching the boy who punched him's dad's truck. He even drew the license plate. (This student got away with it because he scored the highest on state tests.) * A female students calling the middle aged PE teacher \"daddy.\" She's saying it just loud enough for the teacher to not hear. * A bully of a student was using racial slurs only when the only Black student seemingly moved away. The student came back, heard about the slurs, and pounced on him. * A student calling himself \"the head doctor.\" * I took FMLA off because I didn't want to get COVID. First day out, the \"movie actor good looking\" student told my teacher replacement that her \"breath smells like her unwashed p----y,\" just because she dared to correct his behavior. * I had a non-verbal student with Autism. He wore onesies and overalls. Mom was petite so she and I would put the garments on her nearly 6-foot son. When I brought up needing another paraprofessional, because this student also head-butted female paraprofessionals and frequently masturbated, the SPED director told me to let him masturbate each morning \"to get it out his system\" because \"it's a biological need.\" * The student who lost both parents within one calendar year happened to be one of the most well-adjusted students I ever had. He was trustworthy and honest.    submitted by    /u/According2020   [link]   [comments]",
    "source_community": "Teachers",
    "post_author": "/u/According2020",
    "score": 0,
    "comment_count": 0,
    "signal_score": 1
  },
  {
    "id": "https://www.reddit.com/r/OnlineEducation/comments/1qdr086/infinilearn_v2ish_update_playable_game_story/",
    "post_title": "Infinilearn (v2ish?) update - PLAYABLE GAME + STORY SNEAK PEEK???",
    "post_url": "https://www.reddit.com/r/OnlineEducation/comments/1qdr086/infinilearn_v2ish_update_playable_game_story/",
    "post_date": "2026-01-15T18:09:40",
    "post_content": "  submitted by    /u/AdrianMartinezz   [link]   [comments]",
    "source_community": "OnlineEducation",
    "post_author": "/u/AdrianMartinezz",
    "score": 0,
    "comment_count": 0,
    "signal_score": 1
  },
  {
    "id": "https://www.reddit.com/r/Teachers/comments/1qdiqcx/cellphone_bans_are_necessary_but_classroom/",
    "post_title": "Cellphone bans are necessary, but classroom teachers should NOT be in charge of it.",
    "post_url": "https://www.reddit.com/r/Teachers/comments/1qdiqcx/cellphone_bans_are_necessary_but_classroom/",
    "post_date": "2026-01-15T12:54:21",
    "post_content": "In NJ all the talk around the local districts is the Cellphone ban . Nearly every meeting I've been to about it, most teachers are fully behind it...I was too until I started seeing some schools plans.  Overwhelmingly, the method used around here is that each room has a calculator storage thing hanging somewhere in the room. Slots are numbered and each kid is assigned a spot to put their phone.  We'd hear from students that liked not having the phones (after a period of separation anxiety of course)... we'd hear from teachers that loved the attention their lesson got instead of a phone. We'd hear from admin that talked about the decrease in write ups... But one question I had always gets swept under the rug...What happens when a kid loses a phone, or gets it stolen from the hanging storage thing? The first answer everyone gives is the reason things like the storage case is a bad idea. \"Where was the teacher, why aren't they I'm control of their room so this does not happen\".  I'm a math teacher, have a math degree and a master's in education. I am not a cellphone police officer. In addition to being responsible for the myriad of things we do...now I have to be liable for over $10000 of electronics every period?  Where is my cellphone police stipend?    submitted by    /u/SouthJerssey35   [link]   [comments]",
    "source_community": "Teachers",
    "post_author": "/u/SouthJerssey35",
    "score": 0,
    "comment_count": 0,
    "signal_score": 1
  },
  {
    "id": "https://www.reddit.com/r/OnlineEducation/comments/1qdhsvn/finding_a_way_to_actually_understand_tricky_topics/",
    "post_title": "Finding a way to actually understand tricky topics",
    "post_url": "https://www.reddit.com/r/OnlineEducation/comments/1qdhsvn/finding_a_way_to_actually_understand_tricky_topics/",
    "post_date": "2026-01-15T12:07:56",
    "post_content": "I’ve always struggled to stay motivated with some school topics - watching videos or reading textbooks only got me so far. Recently, I tried Skysmart, an online platform with interactive lessons, and it honestly changed how I approach learning. Being able to ask questions in real time, follow along at my own pace, and see concepts explained in a clear, engaging way made things click in a way self-study never did. It’s not a magic solution, but it finally made learning feel less like a chore and more like something I could understand and enjoy. Has anyone else tried platforms like this or found ways to make tricky subjects actually stick? I’d love to hear what worked for you.    submitted by    /u/Griffin_Tanner   [link]   [comments]",
    "source_community": "OnlineEducation",
    "post_author": "/u/Griffin_Tanner",
    "score": 0,
    "comment_count": 0,
    "signal_score": 1
  },
  {
    "id": "https://www.reddit.com/r/HomeschoolRecovery/comments/1qd9uel/i_dont_think_homeschooling_is_bad_i_just_think_it/",
    "post_title": "I don't think homeschooling is bad. I just think it is almost always done wrong.",
    "post_url": "https://www.reddit.com/r/HomeschoolRecovery/comments/1qd9uel/i_dont_think_homeschooling_is_bad_i_just_think_it/",
    "post_date": "2026-01-15T04:28:56",
    "post_content": "I think under the right circumstances, homeschooling can help a kids thrive. Enough socialization is key. Unfortunately I didn't have that. I have been dying to share my story with anyone who will listen and tell me I'm not crazy for feeling the way I feel. I was in regular school until I was 7. My mom had me start school a year late because she didn't think I was ready. That caused a lot of problems for me. I was constantly bullied, and the teachers barely batted an eyelash, since \"I was older and I could deal with it\". I know what the kids and teachers did was wrong, but I still hold this against my mom for not giving me a fair chance. I was in regular school from age 4-7 (Jewish schools have three grades before 1st grade: nursery where kids are 3 turning 4, kindergarten, where kids are 4 turning 5, and pre1A, which is basically pre first grade, where kids are 5 turning 6. My birthday is in February, so I was a full year and more older than my peers. I was also very emotional and cried a lot which definitely didn't help my case (was diagnosed with very high functioning ADHD last year so might have had something to do with this). I really could have benefited from therapy then, but didn't start until I was 16. My mom started homeschooling me when I was in first grade. She said we were just going to try it out for a few weeks. A few weeks turned into years and years. I didn't mind so much. I was able to sleep in, and I was able to take a little more time with my schoolwork if needed. And if I finished early enough, I got to watch TV for the rest of the day. My mom said I was a happy kid. But there were so many signs that I was crying for help that she missed. First of all, socialization was a joke. The only time we left the house during the week was to go grocery shopping, but if my mom didn't need to run any errands, I would easily go two-three days without leaving the house. I was extremely lucky to have friends. I had a group of girls on my block that I was very friendly with, but didn't start hanging out with regularly until I was ten, so from age 7-10 the only kid I would play with regularly was my sister who I fought with all the time. My friends were not homeschooled so the only time I would see them was on Saturdays (the Sabbath, which is the Jewish day of rest). I remember whenever I wasn't able to see them, I would cry and cry. I did not make any new friends until adulthood. I wasn't in summer camp. I wasn't in any extra curricular activities. I didn't realize how much this messed me up until adulthood. As for academics, I didn't really have to work so hard, so I didn't. I did the work but that's it. Didn't retain much info and had a hard time focusing. My ADHD diagnosis back in June made everything click into place.  Now as an adult, I feel that I am doing okay. Not great, but okay. I have made many more friends and I am working part time. I am hopefully getting my ged in May so please pray for me y'all. If you guys are wondering about my feelings towards my mom, I think it was very brave of her to take on a role as a single stay at home mom. I think she truly tried her best but at the end of the day, the results matter more than the intentions. Do I forgive her? For the most part, yes. Do I still get very upset when I think about my childhood? Yes. I have talked to my mom multiple times about what I went through and she is adamant that I was a happy kid and thrived. She refuses to acknowledge that it was anything but a positive experience. I have given up on trying to change her mind. Here's the thing: I am not against homeschooling at all. I think under the right circumstances, it can be very beneficial for a child, given that they have the academic and social tools needed. I don't plan on homeschooling my future kids, but if I end up doing it, things are sure going to be a lot different than how I experienced it. Thanks for reading my rant    submitted by    /u/fashionfan007   [link]   [comments]",
    "source_community": "HomeschoolRecovery",
    "post_author": "/u/fashionfan007",
    "score": 0,
    "comment_count": 0,
    "signal_score": 1
  },
  {
    "id": "https://www.reddit.com/r/teaching/comments/1qd9g53/i_feel_like_im_being_made_to_gang_up_on_another/",
    "post_title": "I feel like I’m being made to gang up on another young teacher in my building…",
    "post_url": "https://www.reddit.com/r/teaching/comments/1qd9g53/i_feel_like_im_being_made_to_gang_up_on_another/",
    "post_date": "2026-01-15T04:09:55",
    "post_content": "So this could be a long post but I will try and keep it short so that you actually want to read it. Basically I teach in a PreK-8 school in Canada, it’s my first year here. We’re at 1280ish students. I teach grade 4/5.  Since before the break there has been this class, 5/6, ran by “Ms. Smith”, that has gotten out of control. Like to the point if you’re near her classroom you can hear her yelling at them or the kids causing problems inside or in the hallway. The kids themselves are good kids but I personally think it’s just a bad mix of big personalities. The teacher herself I actually went to university with and I don’t think she’s a bad teacher, I just think it’s a bad fit. Before the break there were whispers that the school was quietly trying to push her to take a stress leave. She had a sub the entire last week before the break. During that time her class was even more awful.  Twice during that week admin asked me to help out during my preps and in return let me skip all my lunch supervision son a nice cold week and still keep my pay. Frankly this is a great trade off when you’re a wimp like me (who never accomplished anything during preps anyways). Her class was fine for me. Not amazing, but no different than my own class. Both times admin would check in and nothing would be wrong. I never saw them ask any other teachers to help out besides me… After the break she returned. But it seems things haven’t gotten any better I guess. Multiple times her students have been lurking around my room or following me at recess to talk to me. It seems they prefer me. That’s nice and all but I have a class already… Today I was asked if during my prep again if I would cover her class and instead I would get a second prep today because there’s extra subs in the building. I said sure again without thinking much about it. Then when I got there admin says that he and their teacher will stay so that he can make her observe how I handle the class and deal with behaviours. It was so awkward. But again no issues. After school today I didn’t stay long because literally everyone else was leaving so I though okay screw this I’ll mark it at home and started leaving too. Admin pulls me aside with the resource team and asks if they cover my actual class the whole day tomorrow like a sub if I can go to her class all day and mentor her…. Now this is getting a little weird…. Right? I said I’ll have to think about it but it seemed like they took that as yes that’s what’s happening tomorrow…     submitted by    /u/ineedtocoughbut   [link]   [comments]",
    "source_community": "teaching",
    "post_author": "/u/ineedtocoughbut",
    "score": 0,
    "comment_count": 0,
    "signal_score": 1
  },
  {
    "id": "https://www.reddit.com/r/HomeschoolRecovery/comments/1qd8qx2/anything_to_read_on_warped_sense_of/",
    "post_title": "anything to read on warped sense of relationships/love?",
    "post_url": "https://www.reddit.com/r/HomeschoolRecovery/comments/1qd8qx2/anything_to_read_on_warped_sense_of/",
    "post_date": "2026-01-15T03:36:05",
    "post_content": "for reference i'm in my early 20s and because of the isolation from being homeschooled by my mother i've never consensually engaged in intimate acts or kissed anyone and have never dated. for the years i've been legally an adult i've been unable to find work because of my ged and thus have not been able to move out of my parents' house or socialize while living here. because of this life i see no point in dating or companionship and feel no desire for either unless inebriated or extremely distraught. most of my interaction with people outside of my family is through the internet who i'm aware also probably have a warped view but they revere love more than anything and most of what they talk about relates to it. this has gone on so long ive begun to question whether \"love\" as depicted in western art is something that even exists. ive had multiple therapists and tried to bring up my inability to feel or understand love but they all were vetted by my parents and put me down or quickly changed the subject when i brought it up. i assume this isn't a unique experience and someone with experience being homeschooled or raised in isolation/a cult has written about dealing with it, either by somehow beginning to feel love or accepting the inability to feel it.    submitted by    /u/onlylovedatnight   [link]   [comments]",
    "source_community": "HomeschoolRecovery",
    "post_author": "/u/onlylovedatnight",
    "score": 0,
    "comment_count": 0,
    "signal_score": 1
  },
  {
    "id": "https://www.reddit.com/r/teaching/comments/1qd8l2m/leaving_career/",
    "post_title": "Leaving career",
    "post_url": "https://www.reddit.com/r/teaching/comments/1qd8l2m/leaving_career/",
    "post_date": "2026-01-15T03:28:16",
    "post_content": "Friday will be my last day as an 8th grade inclusion teacher. Before that, I taught 7th grade ELA for three years and inclusion for three years. Now that my brain has finally slowed down enough to look back, I find myself asking how I stayed in a job that often felt more harmful than healthy for so long. If it wasn’t coming from students—who were often sent right back after serious behaviors, somehow making teachers feel at fault for documenting them—it seemed to come from elsewhere. From a lack of support. From poor communication. From little encouragement or positive feedback. From feeling unheard by leadership and sometimes even colleagues. With low pay and limited resources, this job is incredibly hard. Hard in ways that aren’t always visible to people outside the classroom. And at some point, I realized I no longer had what I needed to truly support my students the way they deserve. What I do know is this: my students were loved. Deeply. Every single day. And that part was real and never wasted. I’m not alone in feeling this way—many teachers I’ve spoken to feel the same exhaustion and confusion. I’m choosing to step away to take care of myself and to find a healthier path forward. To teachers still in it: I see you. This work is heavy, and you are not weak for feeling that     submitted by    /u/kraftkristi   [link]   [comments]",
    "source_community": "teaching",
    "post_author": "/u/kraftkristi",
    "score": 0,
    "comment_count": 0,
    "signal_score": 1
  },
  {
    "id": "https://www.reddit.com/r/HomeschoolRecovery/comments/1qd0uiz/attention_span/",
    "post_title": "Attention span",
    "post_url": "https://www.reddit.com/r/HomeschoolRecovery/comments/1qd0uiz/attention_span/",
    "post_date": "2026-01-14T22:00:20",
    "post_content": "Hi, I’m 14, 9th grade, homeschooled since I was in 1st grade and I’m neurodivergent and gifted in a toxic household, pretty sure I have some sort of ADHD or severe issue, because I just can’t focus + no energy or motivation for anything + constant brain fog from chronic illness, disordered eating, medicine, and unsolvable exhaustion has been eating me up. I can’t even read a single page of a book and I can’t comprehend it. I’ve begun to read the Hunchback of Notre-Dame by Victor Hugo for an online literature class I’m in, but whenever I try to read the assigned pages, my mind just drifts elsewhere, I grab my phone or start fidgeting with my fingers or anything around me and I just can’t comprehend it. I can’t. Like it feels impossible to try and read it and for the words to click or go through my head and get processed especially because it’s very wordy and confusing. I used it be so smart and ambitious but now I’m literally stupid atp. That’s why I haven’t done math in months and I feel like my life is over and i”m doomed. I just can’t anymore. I plan to cut back on my social media usage and doomscrolling(I have a phone addiction) and I’ve been going out to take walks in my backyard + take more online classes to stay away from my parents and slowly try to recover from this funk, but now I’m going to do a math course with my mom teaching me. And I don’t know when I’ll ever feel better and fix my chronic gut issues, I‘m so overwhelmed feeling like everything is over and my childhood is being robbed when I’m only 14. Does anyone have tips to fix my attention span and try to understand the book I’m reading and be disciplined and just read carefully, the words just aren’t clicking in my head i feel beyond idiotic and my brain feels fried. I srsly can’t anymore I feel constantly in flight or fight and stress and I can’t focus on a thing (and my mom is anti therapy even tho my doctors continually recommend it, I think therapy would help with all my issues) I just feel hopeless right now.    submitted by    /u/Looveeat   [link]   [comments]",
    "source_community": "HomeschoolRecovery",
    "post_author": "/u/Looveeat",
    "score": 0,
    "comment_count": 0,
    "signal_score": 1
  },
  {
    "id": "https://www.reddit.com/r/edtech/comments/1qcxz1y/we_keep_treating_code_like_text_instead_of/",
    "post_title": "We keep treating code like text instead of compressed knowledge",
    "post_url": "https://www.reddit.com/r/edtech/comments/1qcxz1y/we_keep_treating_code_like_text_instead_of/",
    "post_date": "2026-01-14T20:11:03",
    "post_content": "Imagine if we were to write a system. that given any code base as Entry point where as an input. Where the entire. Repository is treated as. Let's call it. Knowledge corpus. And then we're not going to go into detail, but let's assume I use. Prompt similar to this. This was used for short code artifacts that I was synthetically generating with AI prompts would look something like this these will parse data and spit out structured json which will be use later to connect everything. #prompt: ``` Analyze a code artifact to extract advanced, domain-specific technical concepts (not basic programming). Scan imports, classes, and specialized functions to identify meaningful techniques, algorithms, libraries, and patterns. Organize these concepts hierarchically by domain, map them to where they appear in the code (functions and line numbers), and record their dependencies. Exclude basic constructs like loops and conditionals. Output the result as structured JSON representing a conceptual knowledge graph of the codebase. ``` Of Of course, this oversimplifies problem. Tracking the overall context of whole source code would be impossible. But I'm saying within the same realm, imagine we treat each file simply as. First we would have to find out where the core logic is, AT and what logic to avoid. 2nd we will just have to. Go in. Abstract away knowledge separated from the context. Just as a form of. Academic knowledge unit. Within the shape of whether it's a software engineering technique, programming technique. Algorithm and data structure technique or is it a mathematical technique or? Is it? Within the realm of machine learning, natural language processing ETC.    submitted by    /u/CheckMysterious2175   [link]   [comments]",
    "source_community": "edtech",
    "post_author": "/u/CheckMysterious2175",
    "score": 0,
    "comment_count": 0,
    "signal_score": 1
  },
  {
    "id": "https://www.reddit.com/r/HomeschoolRecovery/comments/1qcuvpp/writing_gives_me_extreme_anxiety_16/",
    "post_title": "Writing gives me extreme anxiety (16).",
    "post_url": "https://www.reddit.com/r/HomeschoolRecovery/comments/1qcuvpp/writing_gives_me_extreme_anxiety_16/",
    "post_date": "2026-01-14T18:19:03",
    "post_content": "I made this post for r/writing. But the post was pulled because it probably went into some topics that might be too serious/unrelated for a writing sub. So maybe it’s be a better fit here idk I’ve seen some of the previous threads about this topic before. But I feel like my situation is more specific, so I need more specific advice (and because I like to vent about stuff). For some context. I suffer from a pretty severe depression, alongside multiple mental illnesses that make focusing on anything feel almost impossible (ADHD, executive dysfunction, Malapadative daydreaming, etc). And on top of that……. I’m homeschooled. And if you know anything about that topic, you can probably understand why that’s a problem for someone like me. I have no sense of routine, basically no oversight, and it’s an environment that allows for procrastination spirals to go on for months. To be as blunt as possible. I’ve essentially folded under the pressure of it all for a while now. I’ve been fucking miserable, but at a certain point it felt like my situation was hopeless, and I decided to just give in to my worst impulses instead of focusing on trying to improve myself or my situation (I’ve been procrastinating “school“ for three months at this point). But it’s starting to set in for me that I have to do better, or else I have to legitimately consider the idea that I’m going to end up dead by the time college comes around. I have a sense of urgency that only comes every so often, and I’m desperate to actually put it to use. But there’s something I need to overcome if I actually want to get out of my procrastination slump. And that is my pretty severe anxiety about writing, and more specifically how awful it all is. I feel like just from reading what I’ve written so far can probably explain that better than I can. It’s a fucking scatterbrained mess of topics that feel like they’ve just been thrown out at once, with nothing actually being said beyond just listing issues I have. it’s all just the weird ramblings of a mentally ill dude, and it’s awful to read. And it’s for that reason that I try and avoid writing unless I have to. It just makes me feel like complete shit, and serves as a reminder that I seemingly can’t be talented at anything in life because of how my brain is wired. But ultimately, I have to push forward and get shit done, or else it’s all but guaranteed I end up in that “dead by college“ scenario I keep dreading. And the first step to solving that is getting over my writing anxiety. Ik it might be too big of an ask for y’all (this is probably something that requires years of therapy/medication to truly overcome). But I don’t have many options for support rn, so I’m trying anything lol.    submitted by    /u/Evil_waffle3   [link]   [comments]",
    "source_community": "HomeschoolRecovery",
    "post_author": "/u/Evil_waffle3",
    "score": 0,
    "comment_count": 0,
    "signal_score": 1
  },
  {
    "id": "https://www.reddit.com/r/HomeschoolRecovery/comments/1qctd1k/i_cant_see_myself_graduating_high_school/",
    "post_title": "i cant see myself graduating high school",
    "post_url": "https://www.reddit.com/r/HomeschoolRecovery/comments/1qctd1k/i_cant_see_myself_graduating_high_school/",
    "post_date": "2026-01-14T17:24:52",
    "post_content": "i was switched to homeschool in 2023 (grade 10). it was supposed to be temporary because my family had to travel, but it ended up sticking. i had no help from my family and i myself didnt care enough to do work consistently. now, my friends graduate this summer and i have yet to finish grade 11. im so ashamed but it's so hard to want to do this all on my own. i want to switch to online school (with an actual teacher) but i'm gonna have to redo grade 11, when i should be in grade 12, and my mom refuses. she knows i'm behind but she doesn't know how behind. i'm so scared to tell her. i don't blame her. she's a single mom and she's spent the past 2 years travelling back and forth to take care of my sick grandparents, but she's relying on me and i feel like a failure. at this rate, i can't even see myself graduating. i dont know how it went so wrong. i used to be a high 90s student that loved school and now i cant even get myself to submit more than one assignment a month. home schooling has ruined my life    submitted by    /u/Hot-Youth1254   [link]   [comments]",
    "source_community": "HomeschoolRecovery",
    "post_author": "/u/Hot-Youth1254",
    "score": 0,
    "comment_count": 0,
    "signal_score": 1
  },
  {
    "id": "https://www.reddit.com/r/HomeschoolRecovery/comments/1qcny36/college_after_home_school/",
    "post_title": "College after Home School?",
    "post_url": "https://www.reddit.com/r/HomeschoolRecovery/comments/1qcny36/college_after_home_school/",
    "post_date": "2026-01-14T13:58:07",
    "post_content": "I went to a private Christian school in the 80's as Homeschooling was not as big as it is now. That school (Braircrest whom i now call Briarcult) often encouraged going to a christian college and then trying to get into public service/office, as a way to influence legislation locally and federally. I ended up going to a non religious college (secular) and i was a fish out of water. Science classes made little sense, history was whacked and english, at times, was like reading romance novels (books banned from Braircult).  I am curious how the Homeschool experience effected you if you went to a 'Secular' university.  I've been curious for decades on how Homeschoolers adapted to Science classes where evolution is nothing more than a shoulder shrug, because its not a disputed fact. How you felt in english classes reading 'forbidden' literature.  I am keenly aware that the Homeschool experience is also one of isolation. NO peer groups to joke around with, pass notes, play jokes. How did you handle and adapt to being on a large campus with a few thousand people or did you adapt? I know a couple of adult Homeschool folks socially. I will say as sweet as they are, they act like they are from a different planet. Social skills are odd and when you get into a real conversation, their worldview is often times shocking.  I have ZERO doubt that Ken Ham's Ark Experience stays afloat (pun intended) financially by the sea of Homeschoolers visiting that place.  If you were homeschooled but went to a non religious university, i would love to hear what it was like for you.    submitted by    /u/ghostofgroucho   [link]   [comments]",
    "source_community": "HomeschoolRecovery",
    "post_author": "/u/ghostofgroucho",
    "score": 0,
    "comment_count": 0,
    "signal_score": 1
  },
  {
    "id": "https://www.reddit.com/r/HomeschoolRecovery/comments/1qck7ig/homeschool_traumas/",
    "post_title": "Homeschool traumas",
    "post_url": "https://www.reddit.com/r/HomeschoolRecovery/comments/1qck7ig/homeschool_traumas/",
    "post_date": "2026-01-14T10:48:01",
    "post_content": "I’ve homeschooled since 2021 , my parents didn’t even taught me how to wash my own goddamn bum , I had no friends …. in sep 2024 I experienced apophenia which means brain starts wiring unrelated shit to some another unrelated shit ! stopped looking at a wall due to fear of the phobia in my own room since a year and half , started goin to school from Oct 2025 , I thought Itd be good but I got bullied … and I started losing appetite over things and stopped enjoying them 14m from India please help a brother out here 🥀     submitted by    /u/That-Excitement-7852   [link]   [comments]",
    "source_community": "HomeschoolRecovery",
    "post_author": "/u/That-Excitement-7852",
    "score": 0,
    "comment_count": 0,
    "signal_score": 1
  },
  {
    "id": "https://www.reddit.com/r/HomeschoolRecovery/comments/1qchohr/is_my_situation_bizarre/",
    "post_title": "is my situation bizarre",
    "post_url": "https://www.reddit.com/r/HomeschoolRecovery/comments/1qchohr/is_my_situation_bizarre/",
    "post_date": "2026-01-14T08:07:03",
    "post_content": "hello all, my three younger siblings (2 under 18) and i, 21F have been homeschooled our entire lives. most of my experience involved no consistent education, no social interactions, no friends, no exercise, no outside activities/sports, few doctor/dentist appointments, few family events, no village, no growth. for some background, when my dad was younger, he moved to a city a few hours away from his home. from what he’s told me, he’s never sounded like the antisocial type of person growing up. in fact he’s done lots of traveling overseas, and has many funny stories from his child/young adulthood. he’s always had a strong interest in computer science and engineering, which wasn’t fully sparked until my mother pointed out his talent. my mother grew up in a well socialized environment with loving and involved parents. they were rougher around the edges due to the time period, but never cruel or abusive, i don’t think. my dad’s mom was wonderful to him, his father was.. unfriendly. i’m not sure what my granddad’s issue was, as i never actually met him, but he was a curmudgeon, a crank, if you will. after my parents fell in love is when my mom moved in. because we weren’t in an area with great public schooling, they decided before having me that they’d homeschool. they ordered the school materials, we were enrolled, but didn’t do much of anything. most days just involved playing loudly with my siblings, talking, and watching tv. typing this out is hard. i wanna say i think we were happy, but i still get that overwhelming feeling of agonizing boredom and.. grey longing when i try recollecting my childhood. i don’t truly know what most days were like. i don’t remember much of anything before 2015. there’s very large gaps in memory from before then, i guess because every day was the same. i’m recently diagnosed ADHD, so multiply that boredom by 1000, and imagine it in the form of a pathogen, consuming that little girl’s core. the only drug was daydreaming. i remember the music, nothing else. road trips and family visits still kinda stick out to me, but the memory of coming back home to a seemingly grey house in a quiet, grey suburban neighborhood in the grey part of town tends to overcloud it. we are very comfortable financially, so we were given many toys (and games/tech eventually.) dinner nights and movie visits are fuzzy, everything is fuzzy. i know we did some things outside of the house, but it never involved human connection.. no relationship building with outside kids. just.. shopping. or going out to eat. i was an angry kid in my adolescence, often taking my frustrations out on my loud, whiny, and aggressive younger brother who i now believe is on the spectrum. how would i know that..? maybe he’s just weird because of our upbringing. maybe all of my siblings are just weird because of this lifestyle. no pets. too much work, and my dad didn’t want us to experience grief at a young age, while my mom found most animals gross. a big reason for sheltering us was that they wanted to protect us from harm. my dad pulls up the statistics for SA against women when i question their reasoning. he doesn’t regret protecting us from that. another concern was teen pregnancy. he’s happy he got me through my teenage years with no children. my self image, sexuality, and views on sex and relationships are now damaged. my mom had a couple petty experiences in school that led her to sheltering us from bullying. apparently she’s also seen things (?) in her previous line of work that validated her beliefs. we are not religious. my parents have their own faiths, but neither wanted to force them onto us, so we know nothing. we aren’t mormons.  “you guys aren’t missing out on anything. kids can’t drive or walk around like in cartoons.” this is what i received when the depression fully hit. and i think i believed them! \"i couldn’t do nothing when i was your age either, trust me.” i don’t think i have the energy to finish this, so i’ll wrap it up for now. one year ago now is when i started treatment for my crippling ADHD. i also made two very loyal friends. those friends and proper treatment made me realize how.. delusional my parents seem. they’ll admit their mistakes, but don’t really see anything wrong. i feel like my reality has been warped. they almost seem unreal now. they’re usually never upset (unless i’m upset,) they can’t communicate on difficult topics, my mom misunderstands everything i ask her, my dad can’t seem to stand negative emotions towards him, they’re not interested in meeting people or doing anything really. they’re like cartoon characters, or NPCs. no depth. the same stories every few weeks. same routine of watching tv and doing chores after work (from home) or outside chores/shopping. does this sound bizarre to you? or is my perception of them incorrect?    submitted by    /u/Icy-College-3643   [link]   [comments]",
    "source_community": "HomeschoolRecovery",
    "post_author": "/u/Icy-College-3643",
    "score": 0,
    "comment_count": 0,
    "signal_score": 1
  },
  {
    "id": "https://www.reddit.com/r/HomeschoolRecovery/comments/1qc9r7p/anyone_else/",
    "post_title": "Anyone else?",
    "post_url": "https://www.reddit.com/r/HomeschoolRecovery/comments/1qc9r7p/anyone_else/",
    "post_date": "2026-01-14T01:23:28",
    "post_content": "Does anyone else that was homeschooled feel mentally stunted and unprepared for the real world? I was homeschooled my entire life and when it came time for me to go out on my own I could barely socialize, had zero idea what I was doing, was awkward around new people and struggled at my jobs. My parents praise it nonstop and tell us they did me and my siblings a favor by doing so, but in reality, they didn’t. I struggled heavily in school understanding a lot of things and it didn’t help when my mom would blow up on me and get extremely angry because I had a hard time understanding things. A lot of school time turned into screaming/yelling disasters and at some point it even turned physical when my mom would slap me for not understanding things. On top of that I even asked multiple times to go to public school so I could take some of the cool classes and advantage of some opportunities that would’ve helped with my career, but all I was told was I would get “influenced” negatively, turn into a brat and be “indoctrinated”. As if shoving the idea down my throat everyday that my entire life purpose is to just find a wife and have kids and slave away till I die isn’t indoctrination itself. I missed out on a lot of opportunities and it genuinely upsets me. She acted as if people treating you like an outcast or questioning your education was a flex, when it was embarrassing to have to explain it all. Kinda random but that’s all I have to say for now.    submitted by    /u/_A239   [link]   [comments]",
    "source_community": "HomeschoolRecovery",
    "post_author": "/u/_A239",
    "score": 0,
    "comment_count": 0,
    "signal_score": 1
  },
  {
    "id": "https://www.reddit.com/r/HomeschoolRecovery/comments/1qbxcgk/adult_homeschool_almuni_support_group/",
    "post_title": "Adult Homeschool Almuni Support Group",
    "post_url": "https://www.reddit.com/r/HomeschoolRecovery/comments/1qbxcgk/adult_homeschool_almuni_support_group/",
    "post_date": "2026-01-13T17:28:54",
    "post_content": "Hello, I wasn't sure how to spread the word, but I have made a support group on Facebook for adults who were homeschooled as children. This is only for those homeschooled, not for parents who are homeschooling. Adult Homeschool Alumni Support Group | Facebook    submitted by    /u/ReaderinRecovery   [link]   [comments]",
    "source_community": "HomeschoolRecovery",
    "post_author": "/u/ReaderinRecovery",
    "score": 0,
    "comment_count": 0,
    "signal_score": 1
  },
  {
    "id": "https://www.reddit.com/r/HomeschoolRecovery/comments/1qbucxr/the_aclu_was_an_evil_organization/",
    "post_title": "The ACLU was an evil organization?",
    "post_url": "https://www.reddit.com/r/HomeschoolRecovery/comments/1qbucxr/the_aclu_was_an_evil_organization/",
    "post_date": "2026-01-13T15:31:35",
    "post_content": "Does anyone else remember being taught this? I was an early 90's homeschooled kid and remember being told that it was an evil organization that wanted to get rid of homeschooling (along with legalizing other evils). They were right up there with CPS as organizations to fear. The \"funniest\" part about it, in retrospect, is that, as far as conservative religious education goes, ours was fairly mundane - we weren't off-grid, my parents followed state guidelines to a T, we weren't abused, the education itself was as comprehensive as possible - I'm not sure what they were so afraid of.     submitted by    /u/HelpIveChangedMyMind   [link]   [comments]",
    "source_community": "HomeschoolRecovery",
    "post_author": "/u/HelpIveChangedMyMind",
    "score": 0,
    "comment_count": 0,
    "signal_score": 1
  },
  {
    "id": "https://www.reddit.com/r/Teachers/comments/1qe6vpj/jammed_copy_machine_lounge_talk/",
    "post_title": "Jammed Copy Machine Lounge Talk",
    "post_url": "https://www.reddit.com/r/Teachers/comments/1qe6vpj/jammed_copy_machine_lounge_talk/",
    "post_date": "2026-01-16T05:00:53",
    "post_content": "Hey everyone! The copy machine is down. We called Susan, and she said it won't be fixed until next week. Anyway, since it's Friday... What were some challenges that you faced recently? Anything that irked you? Maybe a co-worker is getting on your nerve? Class caught on fire because little Billy shoved a crayon into your pencil sharpener? Share all the vents and stories below!    submitted by    /u/AutoModerator   [link]   [comments]",
    "source_community": "Teachers",
    "post_author": "/u/AutoModerator",
    "score": 0,
    "comment_count": 0,
    "signal_score": 0
  },
  {
    "id": "https://www.reddit.com/r/Virtuallearning/comments/1qe6crt/ice_agents_near_schools_are_terrifying_our_kids/",
    "post_title": "ICE agents near schools are terrifying our kids - we need virtual learning options now",
    "post_url": "https://www.reddit.com/r/Virtuallearning/comments/1qe6crt/ice_agents_near_schools_are_terrifying_our_kids/",
    "post_date": "2026-01-16T04:33:47",
    "post_content": "  submitted by    /u/Inevitable_Credit714   [link]   [comments]",
    "source_community": "virtuallearning",
    "post_author": "/u/Inevitable_Credit714",
    "score": 0,
    "comment_count": 0,
    "signal_score": 0
  },
  {
    "id": "https://www.reddit.com/r/teaching/comments/1qe5hqr/nystce_eas/",
    "post_title": "NYSTCE EAS",
    "post_url": "https://www.reddit.com/r/teaching/comments/1qe5hqr/nystce_eas/",
    "post_date": "2026-01-16T03:51:35",
    "post_content": "I’m taking this exam tomorrow. I studied the best I could and did a practice test. But I’m still nervous because I don’t work well with timed tests, especially that this exam has heavy reading, analysis and application. Any advice for those that taken it or are studying for it now?    submitted by    /u/Traditional_Gap3214   [link]   [comments]",
    "source_community": "teaching",
    "post_author": "/u/Traditional_Gap3214",
    "score": 0,
    "comment_count": 0,
    "signal_score": 0
  },
  {
    "id": "https://www.reddit.com/r/Teachers/comments/1qe5cfm/new_hampshire_house_education_chair_pushes_for/",
    "post_title": "New Hampshire House Education Chair pushes for “politically segregated” schools",
    "post_url": "https://www.reddit.com/r/Teachers/comments/1qe5cfm/new_hampshire_house_education_chair_pushes_for/",
    "post_date": "2026-01-16T03:44:31",
    "post_content": "Through a leaked conversation between the Education committee in the state of New Hampshire, comments from Rep. Kristin Noble were noted for their harsh reality of the conservative agenda. Comments such as the push for “politically segregated schools“ are followed with other outlandish comments such as the following:  “It’s funny to watch the Democrats feign outrage when I thought they’d be supportive of managing their own schools, with libraries full of porn, biological males in girls sports and bathrooms, and as much DEI curriculum as their hearts desire,” she said in a statement sent through the House Republican Office. “Schools like that will have terrible test scores because they focus on social justice rather than academics.”   People like state Rep. Kristin Noble will continue to erode public education with their perverse ideology. It‘s important that we motivate individuals to actively participate in the electoral process at all differing levels of the government. Article for the main story: https://www.concordmonitor.com/2026/01/15/following-leaked-messages-house-republican-education-chair-says-she-favors-politically-segregated-schools/    submitted by    /u/Bleeding_Irish   [link]   [comments]",
    "source_community": "Teachers",
    "post_author": "/u/Bleeding_Irish",
    "score": 0,
    "comment_count": 0,
    "signal_score": 0
  },
  {
    "id": "https://www.reddit.com/r/teaching/comments/1qe4cg8/quitting_teaching_with_a_student_teacher/",
    "post_title": "Quitting Teaching with a Student Teacher",
    "post_url": "https://www.reddit.com/r/teaching/comments/1qe4cg8/quitting_teaching_with_a_student_teacher/",
    "post_date": "2026-01-16T02:58:46",
    "post_content": "So here’s the situation: I signed on to be a mentor teacher for a student teacher in the fall, before had I decided to leave teaching. I intended on finishing out the school year and starting a new job in the summer. I recently got an offer that would start in the next month that I really don’t want to pass up and likely wont come around again. I really don’t want to screw over my student teacher and her placement, nor risk her ability to graduate on time. However, I don’t want to stay just for her sake and risk losing this new career opportunity that I’m really excited about. Any suggestions?    submitted by    /u/Top-Recognition-508   [link]   [comments]",
    "source_community": "teaching",
    "post_author": "/u/Top-Recognition-508",
    "score": 0,
    "comment_count": 0,
    "signal_score": 0
  },
  {
    "id": "https://www.reddit.com/r/edtech/comments/1qe4bw2/ai_tools_that_support_ela_skillbuilding_whats/",
    "post_title": "AI tools that support ELA skill-building — what’s working?",
    "post_url": "https://www.reddit.com/r/edtech/comments/1qe4bw2/ai_tools_that_support_ela_skillbuilding_whats/",
    "post_date": "2026-01-16T02:58:05",
    "post_content": "I’m trying to understand what’s actually useful right now for ELA practice. Schools are understandably strict about AI for writing assignments, so I’m not looking for “write my essay” tools. I’m curious about tools/workflows that help with things like: reading comprehension practice, vocabulary support, sentence expansion, outlining, and feedback that nudges kids to revise rather than generates the work for them. Any tools or approaches in this space? And also I'm curious what are the biggest concerns you’ve run into with them?    submitted by    /u/Melodic-Support-2117   [link]   [comments]",
    "source_community": "edtech",
    "post_author": "/u/Melodic-Support-2117",
    "score": 0,
    "comment_count": 0,
    "signal_score": 0
  },
  {
    "id": "https://www.reddit.com/r/Teachers/comments/1qe2yfy/students_laughed_in_my_face_when_calling_home/",
    "post_title": "Students laughed in my face when calling home!!!",
    "post_url": "https://www.reddit.com/r/Teachers/comments/1qe2yfy/students_laughed_in_my_face_when_calling_home/",
    "post_date": "2026-01-16T01:57:08",
    "post_content": "Art, Elem, Title 1, I have a fourth grade class that is so bad that they haven't been able to do their assignment for two weeks, we meet once a week, it was so bad yesterday that I called home for a student who wouldn't stop talking and stood behind me and started mocking me. I threatened to call home, and he had the nerve to laugh at me, and when he finished speaking to his guardian, and we hung up the phone, he sat down and started talking loudly again, and laughing with the loud group again. Nothing changed! I've called multiple parents for three other students and they still remain feral. What have I done wrong? I do have expectations in the art room!    submitted by    /u/KiyoXDragon   [link]   [comments]",
    "source_community": "Teachers",
    "post_author": "/u/KiyoXDragon",
    "score": 0,
    "comment_count": 0,
    "signal_score": 0
  },
  {
    "id": "https://www.reddit.com/r/teaching/comments/1qe1bd9/considering_getting_art_teaching_degree/",
    "post_title": "Considering getting art teaching degree",
    "post_url": "https://www.reddit.com/r/teaching/comments/1qe1bd9/considering_getting_art_teaching_degree/",
    "post_date": "2026-01-16T00:43:45",
    "post_content": "I (28m) am strongly considering getting a degree to teach art. I got my undergrad in fine art and have been working with kids since I graduated. I never really wanted to be a teacher or thought that’s where I’d end up, but I’ve found that I really enjoy working with kids and can’t really picture myself following any other kind of “traditional” career. And the paid breaks and holidays are really sounding good to me right about now. I’m looking for any advise, feedback, or info that could help me decide if this is the right path for me.  Thanks!    submitted by    /u/ikeaike   [link]   [comments]",
    "source_community": "teaching",
    "post_author": "/u/ikeaike",
    "score": 0,
    "comment_count": 0,
    "signal_score": 0
  },
  {
    "id": "https://www.reddit.com/r/Teachers/comments/1qe0jxz/i_think_im_done/",
    "post_title": "I think I’m done",
    "post_url": "https://www.reddit.com/r/Teachers/comments/1qe0jxz/i_think_im_done/",
    "post_date": "2026-01-16T00:11:16",
    "post_content": "I think I’m done. I don’t think I’m good at this. I feel like every time I think I’ve got it figured out and we’re improving and doing well, here comes admin saying the coaches “have concerns” but those concerns are never directly communicated to me to fix.  I’m over it. I worked in a freaking bar, did double shifts, got home at 3 am and woke up at 8 am the next day for morning shift and never felt this drained, exhausted, insecure, undervalued and incapable.  What can I do with a teaching degree that has nothing to do with education? I want to be as far removed as possible.     submitted by    /u/Auroralightss_83   [link]   [comments]",
    "source_community": "Teachers",
    "post_author": "/u/Auroralightss_83",
    "score": 0,
    "comment_count": 0,
    "signal_score": 0
  },
  {
    "id": "https://www.reddit.com/r/Teachers/comments/1qdzrzn/fake_names_on_my_detention_list/",
    "post_title": "Fake names on my detention list...",
    "post_url": "https://www.reddit.com/r/Teachers/comments/1qdzrzn/fake_names_on_my_detention_list/",
    "post_date": "2026-01-15T23:39:55",
    "post_content": "I keep a list on my board of students that I've given lunch detentions. Once they've served a detention, I erase their name. Sometimes the list is empty, so I fill it with a few fake names. Students look forward to seeing who's on the list. [I have to keep these G-rated]. Here's the names I phase in and out of the list.  * Anita Bath * Barb Dwyer * Bea O'Problem * Brock Lee * Carrie Oakey * Clair Annette * Dawn Key * Ella Vader * Joe King * Justin Case * Noah Dia * Noah Fence * Oliver Sudden * Patty O'Furniture * Rita Book * Robyn Banks * Stan Dupp * Stan Still * Sue Permann * Terra Bull * Terri Aki * Willie Makeit & Betty Wont    submitted by    /u/ocashmanbrown   [link]   [comments]",
    "source_community": "Teachers",
    "post_author": "/u/ocashmanbrown",
    "score": 0,
    "comment_count": 0,
    "signal_score": 0
  },
  {
    "id": "https://www.reddit.com/r/Teachers/comments/1qdzed1/measles_is_now_in_my_district/",
    "post_title": "Measles is now in my district",
    "post_url": "https://www.reddit.com/r/Teachers/comments/1qdzed1/measles_is_now_in_my_district/",
    "post_date": "2026-01-15T23:24:32",
    "post_content": "I live in a county that borders another county that is in the midst of a major measles outbreak. Honestly, I'm shocked that it hasn't been in my school district before today but we just got a phone home telling us that a student has been diagnosed with measles and we need to be able to provide proof of measles vaccination. This is 2026. What the hell?    submitted by    /u/You_are_your_home   [link]   [comments]",
    "source_community": "Teachers",
    "post_author": "/u/You_are_your_home",
    "score": 0,
    "comment_count": 0,
    "signal_score": 0
  },
  {
    "id": "https://www.reddit.com/r/teaching/comments/1qdyod4/about_to_quit_schoolyear_length_paraprofessional/",
    "post_title": "About to quit school-year length paraprofessional job with 2 weeks notice—implications on background check for new job in unrelated field, and if I ever want to be become a teacher in another district or state?",
    "post_url": "https://www.reddit.com/r/teaching/comments/1qdyod4/about_to_quit_schoolyear_length_paraprofessional/",
    "post_date": "2026-01-15T22:55:40",
    "post_content": "I am in my first year as a paraprofessional and am considered a long term sub. I work in the same classrooms each day. I got offered a full time corporate job in another city that starts in 3 weeks, and I am likely going to accept it. I am nervous as to how my principal is going to react when I tell her I am quitting, and if that will show up badly on a background check for the new job I am accepting. I’ve heard that quitting can be that I can never become a teacher in my state. Please advise.     submitted by    /u/Southern_Schedule466   [link]   [comments]",
    "source_community": "teaching",
    "post_author": "/u/Southern_Schedule466",
    "score": 0,
    "comment_count": 0,
    "signal_score": 0
  },
  {
    "id": "https://www.reddit.com/r/teaching/comments/1qdyjso/thinking_about_leaving_teaching_curious_about/",
    "post_title": "Thinking about leaving teaching, curious about other paths",
    "post_url": "https://www.reddit.com/r/teaching/comments/1qdyjso/thinking_about_leaving_teaching_curious_about/",
    "post_date": "2026-01-15T22:50:43",
    "post_content": "I’m currently in my third year of elementary teaching. I love the kids and the fun parts of the job, but the administration, long hours, and lack of work/life balance are starting to wear me down. I’m considering a career switch, or at least exploring what’s out there. Has anyone here made a switch either for themselves or know someone else that did it? What was the experience like? Any regrets or surprises along the way? I’d love to hear stories from people who have transitioned out of teaching.    submitted by    /u/Ok_Distribution_727   [link]   [comments]",
    "source_community": "teaching",
    "post_author": "/u/Ok_Distribution_727",
    "score": 0,
    "comment_count": 0,
    "signal_score": 0
  },
  {
    "id": "https://www.reddit.com/r/edtech/comments/1qdxwvu/asu_gsv_2026_san_diego/",
    "post_title": "ASU GSV 2026 - San Diego",
    "post_url": "https://www.reddit.com/r/edtech/comments/1qdxwvu/asu_gsv_2026_san_diego/",
    "post_date": "2026-01-15T22:25:57",
    "post_content": "Anyone else going? Let's connect!    submitted by    /u/Tight_Network7643   [link]   [comments]",
    "source_community": "edtech",
    "post_author": "/u/Tight_Network7643",
    "score": 0,
    "comment_count": 0,
    "signal_score": 0
  },
  {
    "id": "https://www.reddit.com/r/teaching/comments/1qdx960/how_do_i_tell_a_student/",
    "post_title": "How do I tell a student...",
    "post_url": "https://www.reddit.com/r/teaching/comments/1qdx960/how_do_i_tell_a_student/",
    "post_date": "2026-01-15T22:00:20",
    "post_content": "I have a student who recently came back from 10 days out with rec of expulsion. According to the student, he's expelled but on probation and if he gets another right up they will implement the expulsion.  I recently had a new student add to my class. This new student is always trying to goat or pick on kids. Today, he told the other students to met him in the stairwell to fight.  How do I tell the student who came back from 10 days out to steer clear of him?     submitted by    /u/Smokey19mom   [link]   [comments]",
    "source_community": "teaching",
    "post_author": "/u/Smokey19mom",
    "score": 0,
    "comment_count": 0,
    "signal_score": 0
  },
  {
    "id": "https://www.reddit.com/r/Teachers/comments/1qdw71g/itll_never_happen_but_id_love_if_teachers_were/",
    "post_title": "It’ll never happen but I’d love if teachers were paid for meetings that go beyond contract time",
    "post_url": "https://www.reddit.com/r/Teachers/comments/1qdw71g/itll_never_happen_but_id_love_if_teachers_were/",
    "post_date": "2026-01-15T21:20:17",
    "post_content": "Title says it     submitted by    /u/Cheap_Parsnip_461   [link]   [comments]",
    "source_community": "Teachers",
    "post_author": "/u/Cheap_Parsnip_461",
    "score": 0,
    "comment_count": 0,
    "signal_score": 0
  },
  {
    "id": "https://www.reddit.com/r/edtech/comments/1qdvsjx/handling_subjective_outcomes_tied_to_refunds_or/",
    "post_title": "Handling subjective outcomes tied to refunds or completion",
    "post_url": "https://www.reddit.com/r/edtech/comments/1qdvsjx/handling_subjective_outcomes_tied_to_refunds_or/",
    "post_date": "2026-01-15T21:05:40",
    "post_content": "For anyone running online programs or education products: When refunds or completion depend on effort or outcomes, do disagreements come up about what “counts”? How do you handle that without endless back-and-forth?    submitted by    /u/Ok-Anything3157   [link]   [comments]",
    "source_community": "edtech",
    "post_author": "/u/Ok-Anything3157",
    "score": 0,
    "comment_count": 0,
    "signal_score": 0
  },
  {
    "id": "https://www.reddit.com/r/Teachers/comments/1qdrzgy/virginia_school_board_adopts_restrictive/",
    "post_title": "Virginia school board adopts restrictive anti-trans policy, blocks GSA",
    "post_url": "https://www.reddit.com/r/Teachers/comments/1qdrzgy/virginia_school_board_adopts_restrictive/",
    "post_date": "2026-01-15T18:44:41",
    "post_content": "Days before a Democratic governor and LGBTQ+ ally is sworn in, a rural Virginia school board in King George County approved a policy forcing teachers and staff to use only the name and pronouns on a student’s official record and limiting bathroom access, travel, and activities based on sex assigned at birth. The board also upheld a ban on a proposed middle-school GSA club. Students and parents warned the changes will worsen bullying and harm LGBTQ+ students’ mental health.    submitted by    /u/Fickle-Ad5449   [link]   [comments]",
    "source_community": "Teachers",
    "post_author": "/u/Fickle-Ad5449",
    "score": 0,
    "comment_count": 0,
    "signal_score": 0
  },
  {
    "id": "https://www.reddit.com/r/teaching/comments/1qdr4nr/who_do_you_follow_for_reading_intervention_ideas/",
    "post_title": "Who do you follow for reading intervention ideas?",
    "post_url": "https://www.reddit.com/r/teaching/comments/1qdr4nr/who_do_you_follow_for_reading_intervention_ideas/",
    "post_date": "2026-01-15T18:14:01",
    "post_content": "Teachers of Reddit, who do you turn to for fresh ideas in reading intervention? I’m especially curious about TikTok and Instagram creators focused on dyslexia and struggling readers. Who’s worth following?    submitted by    /u/Capable-Tourist9595   [link]   [comments]",
    "source_community": "teaching",
    "post_author": "/u/Capable-Tourist9595",
    "score": 0,
    "comment_count": 0,
    "signal_score": 0
  },
  {
    "id": "https://www.reddit.com/r/HomeschoolRecovery/comments/1qdqtvx/does_anyone_here_do_the_full_course_challenges_on/",
    "post_title": "Does anyone here do the full course challenges on Khan? and am I missing out or something by only doing the unit tests?",
    "post_url": "https://www.reddit.com/r/HomeschoolRecovery/comments/1qdqtvx/does_anyone_here_do_the_full_course_challenges_on/",
    "post_date": "2026-01-15T18:03:28",
    "post_content": "Hey guys so I'm done with 7th grade but I wanted to ask if i'm missing out on learning by not doing the full course tests and just doing the unit tests. I don't do them because 30 questions seems stressful for me    submitted by    /u/TaintedMaggieEnjoyer   [link]   [comments]",
    "source_community": "HomeschoolRecovery",
    "post_author": "/u/TaintedMaggieEnjoyer",
    "score": 0,
    "comment_count": 0,
    "signal_score": 0
  },
  {
    "id": "https://www.reddit.com/r/teaching/comments/1qdq0gb/former_reading_dyslexia_intervention_teacher/",
    "post_title": "Former Reading / Dyslexia Intervention Teacher — Curriculum Advice?",
    "post_url": "https://www.reddit.com/r/teaching/comments/1qdq0gb/former_reading_dyslexia_intervention_teacher/",
    "post_date": "2026-01-15T17:34:52",
    "post_content": "Hi everyone, I’m a former reading intervention teacher who worked primarily with students with dyslexia and other language-based learning differences. I’m transitioning into private tutoring and small-group instruction, and I’m looking for recommendations on high-quality, research-based literacy curricula to use outside of a school setting. In schools I’ve used structured literacy approaches aligned with Orton-Gillingham, but now that I’m purchasing my own materials I’m trying to be thoughtful about what’s actually worth the investment. I’d love to hear from tutors, interventionists, or parents about programs that are:  Effective for dyslexia and struggling readers Easy to use in 1:1 or small-group settings Flexible across grade levels Reasonably priced or good value for independent educators  I’m especially interested in phonics, decoding, fluency, spelling, and reading comprehension resources that work well together. If you’ve had success with specific programs, workbooks, or digital tools, I’d really appreciate your input. Thanks in advance!    submitted by    /u/tatteredtarotcard   [link]   [comments]",
    "source_community": "teaching",
    "post_author": "/u/tatteredtarotcard",
    "score": 0,
    "comment_count": 0,
    "signal_score": 0
  },
  {
    "id": "https://www.reddit.com/r/teaching/comments/1qdp17h/67_kids/",
    "post_title": "67 kids",
    "post_url": "https://www.reddit.com/r/teaching/comments/1qdp17h/67_kids/",
    "post_date": "2026-01-15T17:00:11",
    "post_content": "Anybody else hear 67 alot thesedays and can’t get thru teaching melodic minor without a giggle? Heres a relatable reel for you 😂  https://www.instagram.com/reel/DTiZWfnkvsK/?igsh=MTI3cGFocGo3ZWY3bg==    submitted by    /u/aaronjohnjams   [link]   [comments]",
    "source_community": "teaching",
    "post_author": "/u/aaronjohnjams",
    "score": 0,
    "comment_count": 0,
    "signal_score": 0
  },
  {
    "id": "https://www.reddit.com/r/teaching/comments/1qdofkz/recommendations_for_printer/",
    "post_title": "Recommendations for printer ?",
    "post_url": "https://www.reddit.com/r/teaching/comments/1qdofkz/recommendations_for_printer/",
    "post_date": "2026-01-15T16:38:20",
    "post_content": "same as title ?     submitted by    /u/ExtensionDress6151   [link]   [comments]",
    "source_community": "teaching",
    "post_author": "/u/ExtensionDress6151",
    "score": 0,
    "comment_count": 0,
    "signal_score": 0
  },
  {
    "id": "https://www.reddit.com/r/Teachers/comments/1qdo2x6/laughter_in_the_classroom/",
    "post_title": "Laughter in the classroom",
    "post_url": "https://www.reddit.com/r/Teachers/comments/1qdo2x6/laughter_in_the_classroom/",
    "post_date": "2026-01-15T16:25:34",
    "post_content": "I teach English as a second language at a high school. Yesterday, we had the word \"suspicious\" in our active vocabulary. The s-sh-s pattern is practically non-existent in their native language, and they couldn't pronounce it. I wasn't aware of their struggle until we started on the lexical activities. They were doing well and answering correctly until we got to 'suspicious.' They just said, \"word number five, miss.\" I said, \"which is?\" They just looked at each other and all at once burst into a chorus of \"shushpish.\" I laughed and repeated it. It took them a few tries of repeating after me to get it right, and every time they got it wrong, they just giggled. It made me so happy to see them laugh at their own mistakes and look so proud of themselves when they got it right. Those moments of levity and their impact on the students' self-esteem are not appreciated enough in my opinion.     submitted by    /u/alcorthebinarystar   [link]   [comments]",
    "source_community": "Teachers",
    "post_author": "/u/alcorthebinarystar",
    "score": 0,
    "comment_count": 0,
    "signal_score": 0
  },
  {
    "id": "https://www.reddit.com/r/Teachers/comments/1qdlc49/i_cannot_afford_to_live_on_a_teacher_salary/",
    "post_title": "I cannot afford to live on a teacher salary",
    "post_url": "https://www.reddit.com/r/Teachers/comments/1qdlc49/i_cannot_afford_to_live_on_a_teacher_salary/",
    "post_date": "2026-01-15T14:42:49",
    "post_content": "I'm nearly 20 years into my career. Divorced with two kids, who I share split custody with my ex-wife.  I live a humble life. I spend as little money as possible. But I am in such a precarious situation. If my car breaks down, I am screwed. My daughter's medical expenses have hobbled me. My dog's unexpected surgery, the same.  I feel like I should be able to absorb these expenses on a professional salary, but alas.  I've been seeking a second job to supplement my income, but the economy is so bad. It's hard to even get a job at walmart. This is nuts. I don't feel like I can keep going like this.     submitted by    /u/PsychologyOverall241   [link]   [comments]",
    "source_community": "Teachers",
    "post_author": "/u/PsychologyOverall241",
    "score": 0,
    "comment_count": 0,
    "signal_score": 0
  },
  {
    "id": "https://www.reddit.com/r/teaching/comments/1qdk89s/looking_for_engaging_efl_class_readers_a1b1/",
    "post_title": "Looking for Engaging EFL Class Readers (A1–B1)",
    "post_url": "https://www.reddit.com/r/teaching/comments/1qdk89s/looking_for_engaging_efl_class_readers_a1b1/",
    "post_date": "2026-01-15T13:58:47",
    "post_content": "Hi everyone!  I’ve just received permission from my principal to choose a new English class reader, and I’d love some advice. I teach English as a Foreign Language to 14–16-year-old students. At the moment, our school only offers Diary of a Wimpy Kid and some very old short stories. My current class is roughly A2–B1 level, and to be honest, many of my students are not very enthusiastic readers  I’m looking for age-appropriate, engaging books that are linguistically accessible (A2/B1). A big plus would be a movie adaptation, as that really helps with motivation and comprehension Since we also have mixed-ability classes, I’d also really appreciate recommendations for A1 or strong A2 level books. What books have worked well with your EFL students? Any titles that even reluctant readers enjoyed?    submitted by    /u/ijustwanttosleep122   [link]   [comments]",
    "source_community": "teaching",
    "post_author": "/u/ijustwanttosleep122",
    "score": 0,
    "comment_count": 0,
    "signal_score": 0
  },
  {
    "id": "https://www.reddit.com/r/HomeschoolRecovery/comments/1qdjd03/how_can_i_make_this_about_me/",
    "post_title": "How Can I Make This about ME",
    "post_url": "https://www.reddit.com/r/HomeschoolRecovery/comments/1qdjd03/how_can_i_make_this_about_me/",
    "post_date": "2026-01-15T13:22:23",
    "post_content": "https://preview.redd.it/d9satozhkidg1.png?width=1068&format=png&auto=webp&s=29cb3885e6bdde8c929dc0387e75b5418d6145ef    submitted by    /u/Unusual-Medium7045   [link]   [comments]",
    "source_community": "HomeschoolRecovery",
    "post_author": "/u/Unusual-Medium7045",
    "score": 0,
    "comment_count": 0,
    "signal_score": 0
  },
  {
    "id": "https://www.reddit.com/r/teaching/comments/1qdiz1h/mental_health_days_in_highneeds_schools_how_do/",
    "post_title": "Mental health days in high-needs schools - how do you decide?",
    "post_url": "https://www.reddit.com/r/teaching/comments/1qdiz1h/mental_health_days_in_highneeds_schools_how_do/",
    "post_date": "2026-01-15T13:05:16",
    "post_content": "I’m a special ed teacher in an ICT class at a high-needs NYC school and struggle with the guilt around calling out when I’m emotionally depleted rather than physically sick. I care a lot about my students and my co-teacher, show up early, and don’t take days lightly — but the emotional load and overstimulation in this setting can sometimes wipe me out to the point where I’m not functioning well. I know sick days exist for a reason, but staffing shortages and coverage issues make it hard not to feel guilty. I don’t want to come off as someone who’s absent, but I also want to be able to do this job sustainably. For those teaching in high-needs NYC (or not NYC) settings: How do you decide when it’s time to take a mental health day? How do you manage the guilt, especially when coverage is tight?    submitted by    /u/Fit_Information2568   [link]   [comments]",
    "source_community": "teaching",
    "post_author": "/u/Fit_Information2568",
    "score": 0,
    "comment_count": 0,
    "signal_score": 0
  },
  {
    "id": "https://www.reddit.com/r/teaching/comments/1qdhgr7/teaching_become_hell_in_2026/",
    "post_title": "Teaching become hell in 2026",
    "post_url": "https://www.reddit.com/r/teaching/comments/1qdhgr7/teaching_become_hell_in_2026/",
    "post_date": "2026-01-15T11:50:02",
    "post_content": "I finally quit teaching . The environment was so toxic students trying to sabotage you , unsupportive administration who blames you for everything and even teachers stand against you . Going through all of this for an average salary isn't worth it stay away and protect your safety     submitted by    /u/Decent-Translator-84   [link]   [comments]",
    "source_community": "teaching",
    "post_author": "/u/Decent-Translator-84",
    "score": 0,
    "comment_count": 0,
    "signal_score": 0
  },
  {
    "id": "https://www.reddit.com/r/teaching/comments/1qddz4d/any_idea_what_sigma_and_rizz_mean_in_the_uk/",
    "post_title": "Any idea what \"sigma\" and \"rizz\" mean in the UK?",
    "post_url": "https://www.reddit.com/r/teaching/comments/1qddz4d/any_idea_what_sigma_and_rizz_mean_in_the_uk/",
    "post_date": "2026-01-15T08:17:04",
    "post_content": "I've heard my 8yo say these words, I asked her what they mean, but she didn’t know, so she's just parroting what others are saying. I used to think \"rizz\" was short for \"charisma,\" but that doesn't seem to be the case anymore? I have no idea what 'sigma' is supposed to mean.    submitted by    /u/Rootayable   [link]   [comments]",
    "source_community": "teaching",
    "post_author": "/u/Rootayable",
    "score": 0,
    "comment_count": 0,
    "signal_score": 0
  },
  {
    "id": "https://www.reddit.com/r/HomeschoolRecovery/comments/1qdbfj4/i_resent_my_mom_for_being_homeschooled/",
    "post_title": "I resent my mom for being homeschooled",
    "post_url": "https://www.reddit.com/r/HomeschoolRecovery/comments/1qdbfj4/i_resent_my_mom_for_being_homeschooled/",
    "post_date": "2026-01-15T05:50:06",
    "post_content": "It’s so humiliating not being able to do things like basic math, im only “good” at the things my mom is good at which means im basically just a copy of her and i wont get any opportunities in life that expand beyond her range  Homeschooling should genuinely be labelled as abuse, its not fair to make children completely lack behind academically and socially     submitted by    /u/Redditdiscuss   [link]   [comments]",
    "source_community": "HomeschoolRecovery",
    "post_author": "/u/Redditdiscuss",
    "score": 0,
    "comment_count": 0,
    "signal_score": 0
  },
  {
    "id": "https://www.reddit.com/r/teaching/comments/1qd5oqc/how_do_you_become_a_or_i_care_tutor_successfully/",
    "post_title": "How do you become a or I care tutor successfully?",
    "post_url": "https://www.reddit.com/r/teaching/comments/1qd5oqc/how_do_you_become_a_or_i_care_tutor_successfully/",
    "post_date": "2026-01-15T01:18:27",
    "post_content": "Where do your students come from? / How do you generate clientele, in other words?  Who built your website?  What's your general availability?  What's the most desirable subject to tutor?    submitted by    /u/CheapIndependence939   [link]   [comments]",
    "source_community": "teaching",
    "post_author": "/u/CheapIndependence939",
    "score": 0,
    "comment_count": 0,
    "signal_score": 0
  },
  {
    "id": "https://www.reddit.com/r/teaching/comments/1qd5fm1/teaching_in_nyc/",
    "post_title": "Teaching in NYC",
    "post_url": "https://www.reddit.com/r/teaching/comments/1qd5fm1/teaching_in_nyc/",
    "post_date": "2026-01-15T01:07:19",
    "post_content": "Is it best to be a DOE, charter, private teacher in NYC? What age is easiest? Most challenging? What subjects sre most in demand? How do you become teacher certified?    submitted by    /u/CheapIndependence939   [link]   [comments]",
    "source_community": "teaching",
    "post_author": "/u/CheapIndependence939",
    "score": 0,
    "comment_count": 0,
    "signal_score": 0
  },
  {
    "id": "https://www.reddit.com/r/HomeschoolRecovery/comments/1qd2aal/suicidal_thoughts/",
    "post_title": "Suicidal thoughts",
    "post_url": "https://www.reddit.com/r/HomeschoolRecovery/comments/1qd2aal/suicidal_thoughts/",
    "post_date": "2026-01-14T22:56:42",
    "post_content": "I know some people here are really depressed thanks to homeschooling. But am i the only one whos got to the point of holding a huge kitchen knife up to my chest and almost stabbing myself?    submitted by    /u/Equal_Help_4164   [link]   [comments]",
    "source_community": "HomeschoolRecovery",
    "post_author": "/u/Equal_Help_4164",
    "score": 0,
    "comment_count": 0,
    "signal_score": 0
  },
  {
    "id": "https://www.reddit.com/r/HomeschoolRecovery/comments/1qcyzz7/howre_most_of_you_guys_feeling_as_of_today/",
    "post_title": "How’re most of you guys feeling as of today?",
    "post_url": "https://www.reddit.com/r/HomeschoolRecovery/comments/1qcyzz7/howre_most_of_you_guys_feeling_as_of_today/",
    "post_date": "2026-01-14T20:49:52",
    "post_content": "Hi 👋  I was “homeschooled” and isolated by my parents for my whole life. They were also emotionally neglectful and emotionally abusive. I ended up going to an adult education program and getting my diploma and also have managed to do very well in college but I still struggle sometimes. Currently I’m on winter break and it’s been hard to not be in my head a lot and thinking about them. I have ADHD and PTSD which doesn’t help at all.  How’re you guys doing? I know it’s hard but I know it does get better even right now as I’m not feeling so well I try to be hopeful.     submitted by    /u/January_Blues7   [link]   [comments]",
    "source_community": "HomeschoolRecovery",
    "post_author": "/u/January_Blues7",
    "score": 0,
    "comment_count": 0,
    "signal_score": 0
  },
  {
    "id": "https://www.reddit.com/r/HomeschoolRecovery/comments/1qcxgmy/socialization_explained_for_homeschoolers_part_1/",
    "post_title": "Socialization Explained for Homeschoolers: Part 1",
    "post_url": "https://www.reddit.com/r/HomeschoolRecovery/comments/1qcxgmy/socialization_explained_for_homeschoolers_part_1/",
    "post_date": "2026-01-14T19:52:35",
    "post_content": "Socialization Explained for Homeschoolers: Part 1 – Homeschooled Voices    submitted by    /u/ConfidenceOne3   [link]   [comments]",
    "source_community": "HomeschoolRecovery",
    "post_author": "/u/ConfidenceOne3",
    "score": 0,
    "comment_count": 0,
    "signal_score": 0
  },
  {
    "id": "https://www.reddit.com/r/HomeschoolRecovery/comments/1qcue7q/no_longer_blinded/",
    "post_title": "No longer blinded",
    "post_url": "https://www.reddit.com/r/HomeschoolRecovery/comments/1qcue7q/no_longer_blinded/",
    "post_date": "2026-01-14T18:01:44",
    "post_content": "Sorry to keep coming back with posts on here I just keep thinking of stuff to put on here. I am forever thankful that I am no longer blinded to the sad, sad, sad reality of unschooling. I have noticed that it turns out dorky losers with no education, that it causes mental illness/isolation/depression, it makes you not enjoy the best times in life, it makes you sick of seeing your family, you dont get things bullied out of you, and that it totally messes up your adult life since you were never used to routine. FOREVER thankful that im no longer blinded from these horrid truths.    submitted by    /u/a_sad_blues_fan37   [link]   [comments]",
    "source_community": "HomeschoolRecovery",
    "post_author": "/u/a_sad_blues_fan37",
    "score": 0,
    "comment_count": 0,
    "signal_score": 0
  },
  {
    "id": "https://www.reddit.com/r/HomeschoolRecovery/comments/1qcta2u/atlantic_article_on_unregulated_homeschooling/",
    "post_title": "Atlantic article on unregulated homeschooling",
    "post_url": "https://www.reddit.com/r/HomeschoolRecovery/comments/1qcta2u/atlantic_article_on_unregulated_homeschooling/",
    "post_date": "2026-01-14T17:21:48",
    "post_content": "Also discusses Block's new book, Homeschooled.    submitted by    /u/rlstollar   [link]   [comments]",
    "source_community": "HomeschoolRecovery",
    "post_author": "/u/rlstollar",
    "score": 0,
    "comment_count": 0,
    "signal_score": 0
  },
  {
    "id": "https://www.reddit.com/r/edtech/comments/1qcpcbc/how_lucrative_would_a_masters_in_instructional/",
    "post_title": "How lucrative would a Masters in Instructional Design be?",
    "post_url": "https://www.reddit.com/r/edtech/comments/1qcpcbc/how_lucrative_would_a_masters_in_instructional/",
    "post_date": "2026-01-14T14:55:25",
    "post_content": "  submitted by    /u/flowerofkurdistan   [link]   [comments]",
    "source_community": "edtech",
    "post_author": "/u/flowerofkurdistan",
    "score": 0,
    "comment_count": 0,
    "signal_score": 0
  },
  {
    "id": "https://www.reddit.com/r/HomeschoolRecovery/comments/1qc489b/education_stunted_by_homeschooling/",
    "post_title": "education stunted by homeschooling",
    "post_url": "https://www.reddit.com/r/HomeschoolRecovery/comments/1qc489b/education_stunted_by_homeschooling/",
    "post_date": "2026-01-13T21:38:43",
    "post_content": "hey guys, i was homeschool from 5th grade up to “graduation.” I feel very educationally stunted, my experience with homeschooling was not a good one. A lot of my education was very religious based and i missed out on very basic understandings or how things work. Mainly history and science based things. I am in college but for business and haven’t learned much to make me feel “caught up.” I’ve been made to feel dumb by peers in the past and I really do want to learn more. I guess my question is have any of you felt this way and how did you go about educating yourself? Is the best route to watch basic history and science youtube videos? If you have what are some good channels? What has helped you?    submitted by    /u/caitydarling   [link]   [comments]",
    "source_community": "HomeschoolRecovery",
    "post_author": "/u/caitydarling",
    "score": 0,
    "comment_count": 0,
    "signal_score": 0
  },
  {
    "id": "https://www.reddit.com/r/HomeschoolRecovery/comments/1qc0c15/i_dont_feel_like_a_teenager/",
    "post_title": "I don't feel like a teenager",
    "post_url": "https://www.reddit.com/r/HomeschoolRecovery/comments/1qc0c15/i_dont_feel_like_a_teenager/",
    "post_date": "2026-01-13T19:14:20",
    "post_content": "Ive posted a couple times on this page before and for some context, I've been homeschooled 1st-present (9th). I only went to Christian school for k5. Both my parents work so therefore I'm at the house alone (my bros are too we just never talk to each other). I'm doing maybe 2 hours of school that I'm totally responsible teaching myself and chores. I want to be with people my own age NOT my brothers. My mom said that she started homeschooling because she heard that siblings who are homeschooled have better relationships (which is the biggest lie I've ever heard that some homeschool moms probably made up to glamourize homeschooling.) All it does is make you sick of seeing your siblings and that you don't want to see them while you're adults prob. The only time I feel like a teenager is when I watch NHL :(    submitted by    /u/a_sad_blues_fan37   [link]   [comments]",
    "source_community": "HomeschoolRecovery",
    "post_author": "/u/a_sad_blues_fan37",
    "score": 0,
    "comment_count": 0,
    "signal_score": 0
  },
  {
    "id": "https://www.reddit.com/r/edtech/comments/1qbtx0u/monthly_developerssales_thread_for_january_2026/",
    "post_title": "Monthly Developers/Sales Thread for January 2026",
    "post_url": "https://www.reddit.com/r/edtech/comments/1qbtx0u/monthly_developerssales_thread_for_january_2026/",
    "post_date": "2026-01-13T15:14:30",
    "post_content": "Greetings r/edtech and welcome developers, salespersons, and others. If you come to this sub seeking feedback or marketing for you product or service, this is the space in which to post. Thank you for your cooperation. We collect all of these posts into a single thread each month to prevent the sub from being overrun with this type of content.    submitted by    /u/AutoModerator   [link]   [comments]",
    "source_community": "edtech",
    "post_author": "/u/AutoModerator",
    "score": 0,
    "comment_count": 0,
    "signal_score": 0
  }
]